import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as NotreDameDeParisImage from '@images/cities/Paris/NotreDameDeParis'

export const NotreDameDeParisData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Нотр-Дам-де-Пари',
    image: [NotreDameDeParisImage.NotreDameDeParisImage, NotreDameDeParisImage.NotreDameDeParis1Image, NotreDameDeParisImage.NotreDameDeParis2Image, NotreDameDeParisImage.NotreDameDeParis3Image, NotreDameDeParisImage.NotreDameDeParis4Image],
    history: 'Собор Парижской Богоматери, или Нотр-Дам, был заложен в 1163 году на острове Сите. Постройка продолжалась почти два века, и завершилась в 1345 году. Нотр-Дам стал символом готической архитектуры, сочетая элементы романского стиля и новые архитектурные решения. Собор пережил множество исторических событий: здесь короновали Генриха VI, а во время Французской революции его осквернили. В 1831 году роман Виктора Гюго «Собор Парижской Богоматери» вновь вернул интерес к этому архитектурному шедевру. Значительная реставрация, проведенная под руководством Эжена Виолле-ле-Дюка в 1844–1864 годах, восстановила утраченные элементы. В 2019 году Нотр-Дам пострадал от пожара, повредившего крышу и шпиль.',
    architecture: 'Нотр-Дам является выдающимся примером готической архитектуры, которая возникла во Франции в XII веке. Собор построен из светлого известняка, что подчеркивает его величественный облик. Главная фасадная сторона собора украшена тремя большими портальными дверями и рядам скульптур, изображающих библейские сюжеты. Высокие колонны и стрельчатые арки создают ощущение легкости и высоты. Внутреннее пространство Нотр-Дам поражает великолепием: витражи, в том числе знаменитая роза, наполняют его цветным светом. Крыша поддерживается сложной системой контрфорсов, а собор имеет восемь капелл, каждая из которых украшена уникальными алтарями. Нотр-Дам не только место поклонения, но и архитектурный шедевр, который стал символом Парижа и всей Франции.'
  }
]