import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as PantheonImage from '@images/cities/Rome/Pantheon'

export const PantheonData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Пантеон',
    image: [PantheonImage.PantheonImage, PantheonImage.Pantheon1Image, PantheonImage.Pantheon2Image, PantheonImage.Pantheon3Image, PantheonImage.Pantheon4Image],
    history: 'Пантеон в Риме, один из лучших сохранившихся памятников древнеримской архитектуры, был построен в 27 году до н. э. по приказу Марка Агриппы, друга и полководца Октавиана Августа. Изначально здание служило языческим храмом, посвящённым всем богам Рима. Но в 118-125 годах н. э. император Адриан осуществил масштабную реконструкцию, создав великолепное сооружение с характерным куполом. Значительное внимание Пантеон привлекало у христиан: в VII веке он был преобразован в церковь, что способствовало его сохранению в течение веков. Ренессансные архитекторы, такие как Брэманте и Микеланджело, восхищались его красотой и инженерными достижениями. Сегодня Пантеон остаётся символом инженерной гениальности и архитектурного совершенства Рима.',
    architecture: 'Пантеон известен своими гармоничными пропорциями и величественной архитектурой. Здание имеет оригинальную круглую форму с классическим портиком и великой ротондой. Купол, диаметр которого составляет 43,3 метра, является одним из крупнейших в мире и на протяжении столетий оставался важным образцом для архитекторов. Его конструкция выполнена из бетона, который становится легче по мере подъёма, что позволяет снизить нагрузку на стены. В центре купола находится око — отверстие диаметром 9 метров, которое освещает интерьеры и создает впечатляющую атмосферу. Пол был выполнен из мозаики, а стены украшены нишами и колоннами. Архитектурные детали Пантеона отражают гармонию и симметрию, что делает его ярким примером древнеримского стиля.'
  }
]