import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as CharlesBridgeImage from '@images/cities/Prague/CharlesBridge'

export const CharlesBridgeData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Карлов мост',
    image: [CharlesBridgeImage.CharlesBridgeImage, CharlesBridgeImage.CharlesBridge1Image, CharlesBridgeImage.CharlesBridge2Image, CharlesBridgeImage.CharlesBridge3Image, CharlesBridgeImage.CharlesBridge4Image],
    history: 'Карлов Мост, один из самых известных исторических памятников Праги, был построен в 1345 году по приказу императора Карла IV. Соединяя Старый город с Малым городом, он стал важным торговым и культурным маршрутом. Известно, что первоначально мост назывался «Мостом камней», однако он получил нынешнее имя в честь императора. Строительство продолжалось до начала 15 века, и он стал символом города. На протяжении веков мост неоднократно становился свидетелем значительных исторических событий: казней, коронаций и даже войн. В XVI веке он был украшен статуями святых, что придает ему особую духовную атмосферу. Мост также пострадал во время наводнений и войн, но его неоднократно восстанавливали и реставрировали. Сегодня Карлов Мост является не только важным транспортным узлом, но и популярной туристической достопримечательностью, притягивающей миллионы посетителей из разных стран.',
    architecture: 'Архитектура моста является выдающимся примером готического стиля, который преобладал в Европе в XIV веке. Мост построен из песчаника, что придает ему теплый оттенок. Его длина составляет 516 метров, ширина – 10 метров. Мост поддерживается на 16 мощных арок, которые обеспечивают его грузоподъемность и устойчивость. Белоснежные статуи, расположенные вдоль моста, – это образы святых, созданные в стиле барокко в XVII-XVIII веках. Архитектуру моста также украшают две башни: Малостранская и Староместская, каждая из которых имеет свою уникальную стилистику. Эти башни, возвышаясь над мостом, создают величественный облик, подчеркивая его историческую значимость.'
  }
]