import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as LondonEyeImage from '@images/cities/London/LondonEye'

export const LondonEyeData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Лондонский глаз',
    image: [LondonEyeImage.LondonEyeImage, LondonEyeImage.LondonEye1Image, LondonEyeImage.LondonEye2Image, LondonEyeImage.LondonEye3Image, LondonEyeImage.LondonEye4Image],
    history: 'Лондонское колесо обозрения, известное как Лондонское глаз, было открыто в марте 2000 года и стало одним из главных символов столицы Великобритании. Идея создания колеса была предложена в 1993 году архитекторами Дэвидом Марксом и Джулией Барфильд как часть празднования нового тысячелетия. Строительство началось в 1998 году, и проект привлек большое внимание благодаря своему инновационному дизайну и неземной высоте. Лондонское глаз высотой 135 метров стало самым высоким колесом обозрения в мире на момент открытия. Оно быстро завоевало популярность среди туристов и местных жителей, предоставляя уникальную возможность насладиться панорамным видом на Лондон. Колесо стало символом современного Лондона, получив множество наград за архитектуру и дизайна, и до сих пор остается одним из самых посещаемых туристических объектов города, привлекая более 3 миллионов посетителей в год.',
    architecture: 'Архитектура Лондонского глаза воплощает в себе современный подход к дизайну и инженерии. Созданное архитектурной компанией Marks Barfield Architects, это колесо обозрения отличается элегантной и минималистичной формой, что придаёт ему лёгкость и воздушность. Лондонское глаз имеет 32 закрытых капсулы, каждая из которых вмещает до 25 человек, и обеспечивает беспрепятственный обзор благодаря своим стеклянным стенкам. Конструкция состоит из стальной рамы, что делает её прочной и устойчивой к ветру. Само колесо вращается медленно, позволяя посетителям наслаждаться видом, не спеша подниматься на высоту. Ночной стиль освещения создаёт волшебную атмосферу, а сам глаз стал достопримечательностью, которая добавляет шарма вечернему Лондону. Архитектура Лондонского глаза гармонично вписывается в городской пейзаж, находясь в непосредственной близости от таких исторических зданий, как Биг-Бен и Вестминстерское аббатство.'
  }
]