import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as MoscowKremlinImage from '@images/cities/Moscow/MoscowKremlin'

export const MoscowKremlinData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Московский Кремль',
    image: [MoscowKremlinImage.MoscowKremlinImage, MoscowKremlinImage.MoscowKremlin1Image, MoscowKremlinImage.MoscowKremlin2Image, MoscowKremlinImage.MoscowKremlin3Image, MoscowKremlinImage.MoscowKremlin4Image],
    history: 'Московский Кремль — это не только символ столицы России, но и важный исторический объект, который отражает развитие страны на протяжении веков. Его история начинается в XII веке, когда на Боровицком холме была построена деревянная крепость. С течением времени Кремль стал центром политической и религиозной жизни Руси. В XIV-XV веках, во время правления Ивана III, началась масштабная каменная реконструкция, что сделало Кремль более мощным и величественным. В XVI-XVII веках здесь строились соборы и дворцы, отражающие богатство и могущество Московского государства. Кремль пережил множество исторических событий, включая осады, восстания и реформы. В XX веке он стал символом советской власти, а сегодня является объектом Всемирного наследия ЮНЕСКО.',
    architecture: 'Архитектура Московского Кремля представляет собой уникальное сочетание различных стилей и эпох. Основные сооружения Кремля выполнены в стиле русской архитектуры, с элементами византийского и готического стилей. Главной доминантой является Успенский собор, построенный в конце XV века, который стал местом коронации русских царей. Внутренние дворцы и храмы украшены великолепными фресками и иконами. Кремлевские стены, построенные в XVI веке, имеют характерные башни с зубцами, каждая из которых имеет свою историю и название. Архитектурный ансамбль Кремля включает также Благовещенский собор, Грановитую палату и Спасскую башню. Вся эта архитектурная композиция создает неповторимый облик Кремля, который привлекает туристов и исследователей со всего мира.'
  }
]