import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as ParqueLageImage from '@images/cities/RioDeJaneiro/ParqueLage'

export const ParqueLageData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Парк Энрике Лаге',
    image: [ParqueLageImage.ParqueLageImage, ParqueLageImage.ParqueLage1Image, ParqueLageImage.ParqueLage2Image, ParqueLageImage.ParqueLage3Image, ParqueLageImage.ParqueLage4Image],
    history: 'Парк Энрике Лаге, расположенный у подножия знаменитой горы Корковадо в Рио-де-Жанейро, был основан в 1940 году благодаря усилиям бразильского бизнесмена и искусствоведа Энрике Лаге. Он приобрел участок земли, который ранее принадлежал старинному особняку, и преобразовал его в прекрасный публичный парк, открывший свои двери для посетителей. Парк стал оазисом природы и искусства, сочетая ботанические сады, пруды и исторические здания. В 1950-х годах парк пережил огромную популярность, в основном благодаря своим культурным мероприятиям и выставкам. Сегодня он служит местом встреч граждан Рио и туристов, предлагая живописные аллеи и насыщенную культурную программу. Парк стал символом взаимодействия природы и искусства, сохранив аутентичный дух бразильской культуры.',
    architecture: 'Архитектура Парка Энрике Лаге отражает гармоничное сосуществование природы и человеческого вмешательства. Центральным элементом парка является великолепный особняк в стиле неоклассики, построенный в начале XX века, который сейчас служит культурным центром. Вокруг него разбиты живописные аллеи, уходящие в запутанные садовые зоны с тропическими растениями, экзотическими деревьями и цветущими кустарниками. Обилие мозаик и художественных инсталляций, разработанных как местными художниками, так и признанными мастерами, придаёт парку уникальность. Кроме того, парк украшен водоемами и мостами, создающими эффект спокойствия. Такие элементы, как каменные лестницы и уютные уголки для отдыха, добавляют ему уюта и заставляют посетителей чувствовать связь с природой. В целом, архитектура парка и его ландшафтный дизайн способствуют созданию атмосферы вдохновения и расслабления.'
  }
]