import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as CopacabanaBeachImage from '@images/cities/RioDeJaneiro/CopacabanaBeach'

export const CopacabanaBeachData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Пляж Копакабана',
    image: [CopacabanaBeachImage.CopacabanaBeachImage, CopacabanaBeachImage.CopacabanaBeach1Image, CopacabanaBeachImage.CopacabanaBeach2Image, CopacabanaBeachImage.CopacabanaBeach3Image, CopacabanaBeachImage.CopacabanaBeach4Image],
    history: 'Пляж Копакабана, расположенный в юго-восточной части Рио-де-Жанейро, изначально был малонаселенным районом, окруженным мангровыми болотами и холмами. В начале 20 века начало развиваться курортное движение, и Копакабана постепенно превратился в популярное место для местных жителей и туристов. В 1920-х годах был построен знаменитый отель "Copacabana Palace", который стал символом роскоши и стиля. Копакабана также известен своей культурной атмосферой: здесь проходили множество карнавальных парадов, музыкальных представлений и спортивных мероприятий. Пляж стал популярным местом встреч, объединяющим людей различных социальных слоев, и сейчас он привлекает миллионы туристов со всего мира, будучи одной из самых известных прибрежных зон Бразилии..',
    architecture: 'Пляж Копакабана протянулся на 4 километра и известен своими характерными черно-белыми узорчатыми плитками, которые создают волны на тротуаре вдоль побережья. Это архитектурное решение, по проекту бразильского архитектора Роберту Бурле Маркcа, добавляет уникальности и эстетической привлекательности этому месту. Приморская линия окружена многими ресторанами, кафе и отелями, которые обеспечивают разнообразие услуг для гостей. Советский корнер, известный как "Площадь Нотр-Дам", служит важной культурной площадкой. Архитектура зданий отражает разнообразные стили, включая арт-деко, модернизм и традиционные бразильские элементы. В сочетании с красивыми пальмами и яркой атмосферой, пляж Копакабана представляет собой образец живого городского пространства, где современность и традиции соединяются в гармонии.'
  }
]