import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as NationalGalleryImage from '@images/cities/London/NationalGallery'

export const NationalGalleryData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Национальная галерея',
    image: [NationalGalleryImage.NationalGalleryImage, NationalGalleryImage.NationalGallery1Image, NationalGalleryImage.NationalGallery2Image, NationalGalleryImage.NationalGallery3Image, NationalGalleryImage.NationalGallery4Image],
    history: 'Национальная галерея в Лондоне была основана в 1824 году, когда правительство Великобритании приобрело коллекцию картин, состоящую из 38 произведений искусства, чтобы сделать живопись доступной для широкой публики. Место для галереи было выбрано на площадке, которая ранее была занята владельцами частной собственности. Строительство основных зданий было завершено к 1838 году, и галерея открыла свои двери для посетителей. С течением времени коллекция галереи значительно расширялась благодаря пожертвованиям и приобретениям, и к настоящему времени насчитывает более 2 300 произведений искусства, включая шедевры великих мастеров, таких как Леонардо да Винчи, Рембрандт, Ван Гог и многих других. Национальная галерея стала важным культурным учреждением и центром искусства в Лондоне, предоставляя возможность изучать и наслаждаться произведениями искусства различных эпох и стилей. Галерея также активно участвует в образовательных программах и выставках, привлекая миллионы посетителей каждый год.',
    architecture: 'Архитектура Национальной галереи в Лондоне является выдающимся примером неоклассического стиля, спроектированного архитектором Уильямом Уилкинсом. Строительство началось в 1832 году и продолжалось до 1848 года, когда были завершены основные элементы здания. Фасад галереи украшен 46 ионийскими колоннами, создающими величественный вход. Внутренние помещения также отличаются элегантностью и продуманностью, включая просторные залы, освещенные естественным светом. Галерея была расширена в 1900-х годах, когда было добавлено новое здание. Одной из примечательных характеристик является центральная лестница, ведущая в главные выставочные залы. Архитектура Национальной галереи гармонично вписывается в исторический контекст Лондона и соседние здания, такие как площадь Тrafalgar, создавая впечатляющую гармонию между искусством и архитектурой.'
  }
]