import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as OldTownSquareImage from '@images/cities/Prague/OldTownSquare'

export const OldTownSquareData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Староместская площадь',
    image: [OldTownSquareImage.OldTownSquareImage, OldTownSquareImage.OldTownSquare1Image, OldTownSquareImage.OldTownSquare2Image, OldTownSquareImage.OldTownSquare3Image, OldTownSquareImage.OldTownSquare4Image],
    history: 'Староместская площадь — это сердце Праги, основанное в XII веке. Изначально здесь располагался рынок, который с течением времени стал местом общественных и религиозных событий. В XIII-XIV веках площадь приобрела статус важного торгового центра. В эпоху готики и Ренессанса здесь проводились коронации, публичные казни и праздники. Одним из ключевых событий стало восстание 1419 года, когда казаки забросали окна одного из зданий Праги, что привело к началу Гуситских войн. Площадь также стала местом протестов и демонстраций в более поздние века. Сегодня она объединяет поколения и привлекает туристов своими историческими событиями, памятниками и культурными мероприятиями.',
    architecture: 'Здесь гармонично соседствуют готика, ренессанс и барокко. Центральным элементом площади является астрономические часы Орлой, установленные в 1410 году, которые привлекают множество туристов. Особняки и церкви, такие как знаменитая церковь святого Николая с её великолепным барочным куполом, также добавляют шарма площади. Ратуша, с её готическими и ренессансными элементами, демонстрирует художественное разнообразие этой местности. Каждое здание на площади рассказывает историю своего времени, создавая атмосферу уникального культурного наследия. Этот архитектурный калейдоскоп делает Староместскую площадь одной из самых красивых и значимых в Европе.'
  }
]