import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as ForoRomanoImage from '@images/cities/Rome/ForoRomano'

export const ForoRomanoData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Римский форум',
    image: [ForoRomanoImage.ForoRomanoImage, ForoRomanoImage.ForoRomano1Image, ForoRomanoImage.ForoRomano2Image, ForoRomanoImage.ForoRomano3Image, ForoRomanoImage.ForoRomano4Image],
    history: 'Римский форум – это сердце древнего Рима, где развивалась политическая, социальная и экономическая жизнь города. Первоначально на этом месте находилась небольшая болотообразная долина, но с развитием города в VI веке до н. э. здесь началось создание общественных пространств. Форум стал центром римской жизни, где проводились выборы, судебные процессы и религиозные обряды. В эпоху республиканского Рима он претерпел значительные изменения, включая строительство зданий, таких как Basilicas и Temples. В I веке н. э. форум достиг своего расцвета, с множеством статуй и памятников. Однако с падением Западной Римской империи в V веке н. э. форум пришел в упадок. На протяжении веков его забрасывали, и многие постройки разрушились. В XIX и XX веках начались археологические раскопки, которые позволили восстановить значимость форума как исторического памятника.',
    architecture: 'Архитектура Римского форума отражает величие и многообразие древнеримского строения. Главной его особенностью является сочетание различных стилей, что свидетельствует о развитии архитектуры от республиканского периода до империи. Форум окружали важные здания, включая храм Юпитера, храм Весты и базилику Эмилия. Классическим примером является базилика — многопрофильное здание с колоннами и аркадой, использовавшееся как рынок и для встреч граждан. Храм Юпитера, построенный в 6 веке до н. э., стал символом мощи Рима. Византийское влияние заметно в поздних реконструкциях. Часто использовались красные кирпичные конструкции, мраморные украшения и сложные элементы, такие как арки и колоннады. Архитектура форума не только служила публичным целям, но и отражала политическую силу и культурные достижения Рима, становясь важным наследием, которое продолжает привлекать внимание историков и туристов сегодня.'
  }
]