import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as JewelChangiAirportImage from '@images/cities/Singapore/JewelChangiAirport'

export const JewelChangiAirportData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Аэропорт Чанги',
    image: [JewelChangiAirportImage.JewelChangiAirportImage, JewelChangiAirportImage.JewelChangiAirport1Image, JewelChangiAirportImage.JewelChangiAirport2Image, JewelChangiAirportImage.JewelChangiAirport3Image, JewelChangiAirportImage.JewelChangiAirport4Image],
    history: 'Аэропорт Чанги, расположенный в Сингапуре, открылся в 1981 году и стал ключевым транспортным узлом в Юго-Восточной Азии. Строительство началось в 1975 году на месте военной базы. Запускась, Чанги сразу же произвел впечатление своей современностью и высоким уровнем сервиса. В 1990-х и 2000-х годах аэропорт активно развивался, и в 2008 году был открыт новый терминал 3. Чанги стал первым аэропортом, получившим звание «лучшего аэропорта мира» по версии Skytrax. Его репутация укрепилась благодаря постоянным улучшениям и внедрению инноваций, включая автоматизацию и высокие технологии. С момента своего открытия аэропорт неоднократно расширялся и обновлялся, и в 2019 году был введен в эксплуатацию терминал 4, а в 2022 году открылся Jewel Changi — многофункциональный комплекс с магазинами, ресторанами и величественным водопадом.',
    architecture: 'Архитектура аэропорта Чанги сочетает в себе функциональность и элегантность. Здание терминалов характеризуется современными линиями и открытыми пространствами, что создает атмосферу комфорта и удобства для пассажиров. Терминалы активно используют естественное освещение, благодаря чему в интерьере много зелени и природных элементов. Jewel Changi, расположенный между терминалами, представляет собой впечатляющий архитектурный проект с величественным водопадом, который является самым высоким внутренним водопадом в мире. Архитектурный стиль аэропорта демонстрирует синергию между современными технологиями и природным окружением, а также заботу о экологии. Правильное сочетание стекла, стали и зелени создает уникальную атмосферу, делая пребывание в аэропорту комфортным и приятным. Чанги стал символом инновационного подхода к проектированию аэропортов по всему миру.'
  }
]