import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as ArcDeTriompheImage from '@images/cities/Paris/ArcDeTriomphe'

export const ArcDeTriompheData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Триумфальная арка',
    image: [ArcDeTriompheImage.ArcDeTriompheImage, ArcDeTriompheImage.ArcDeTriomphe1Image, ArcDeTriompheImage.ArcDeTriomphe2Image, ArcDeTriompheImage.ArcDeTriomphe3Image, ArcDeTriompheImage.ArcDeTriomphe4Image],
    history: 'Триумфальная арка в Париже — один из самых знаковых памятников французской архитектуры, символизирующий победы и достижения нации. Идея создания арки возникла после Великой французской революции, но её строительство началось только в 1806 году по указу Наполеона Бонапарта, в честь его побед в войнах. Проект был создан архитектором Жаном-Франсуа Шальгреном, а затем продолжен другими архитекторами, включая Жана-Николя Гюйо. Арка была окончательно завершена в 1836 году, уже после падения Наполеона. В течение своей истории она стала местом множества исторических событий, включая победные парады и поминальные церемонии. Под аркой находится могила Неизвестного солдата, что добавляет ей дополнительную символическую значимость.',
    architecture: 'Триумфальная арка представляет собой выдающийся пример неоклассической архитектуры. Высота арки достигает 50 метров, ширина — 45 метров, что впечатляет масштабами и величественностью. Арка украшена рельефами и скульптурами, изображающими сцены сражений и фигуры национальных героев. Строение состоит из четырех мощных пилонов, увенчаных большой крышкой. Стены арки украшены надписями с именами генералов и битв. Особое внимание привлекает центральный проем, который открывает вид на Париж и ведет к знаменитой авеню Шарля де Голля. Архитектура арки служит постоянным напоминанием о богатой истории и культурном наследии Франции.'
  }
]