import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as EmpireStateBuildingImage from '@images/cities/NewYork/EmpireStateBuilding'

export const EmpireStateBuildingData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Эмпайр-стейт-билдинг',
    image: [EmpireStateBuildingImage.EmpireStateBuildingImage, EmpireStateBuildingImage.EmpireStateBuilding1Image, EmpireStateBuildingImage.EmpireStateBuilding2Image, EmpireStateBuildingImage.EmpireStateBuilding3Image, EmpireStateBuildingImage.EmpireStateBuilding4Image],
    history: 'Эмпайр-стейт-билдинг, расположенный в Нью-Йорке, был завершен в 1931 году и стал символом американской архитектуры и амбиции. Проектирование началось в 1929 году в условиях жесткой конкуренции с другими небоскребами, такими как Крайслер-билдинг. Строительство началось в начале Великой депрессии, и здание было построено рекордными темпами — всего за 410 дней. Архитекторы из фирмы Shreve, Lamb and Harmon  создали это здание в стиле ар-деко. С высотой 381 метр (443 метра с антенной) оно стало самым высоким зданием в мире на момент завершения. Эмпайр-стейт-билдинг быстро стал популярным среди туристов и был в центре множества культурных произведений, олицетворяя надежду и стремление к успеху даже в трудные времена.',
    architecture: 'Эмпайр-стейт-билдинг является ярким примером архитектуры в стиле ар-деко, с его характерными геометрическими формами и элегантными линиями. Здание состоит из 102 этажей, причем у него уникальный силуэт, который определяется многоугольной крышей и выступающей антенны. Фасад отделан светло-серым гранитом и алюминием, что придаёт ему блеск и современность. Внутренние пространства, включая лобби, украшены мрамором, декоративными панелями и художественными фресками, отражающими процветание 1930-х годов. Эмпайр-стейт-билдинг также известен своими смотровыми площадками на 86 и 102 этажах, откуда открываются панорамные виды на Нью-Йорк. Этот небоскреб стал иконой города и важной частью его архитектурного наследия.'
  }
]