import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as SkyGardenImage from '@images/cities/London/SkyGarden'

export const SkyGardenData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Скай Гарден',
    image: [SkyGardenImage.SkyGardenImage, SkyGardenImage.SkyGarden1Image, SkyGardenImage.SkyGarden2Image, SkyGardenImage.SkyGarden3Image, SkyGardenImage.SkyGarden4Image],
    history: 'Скай Гарден, расположенный на верхних этажах здания «20 Fenchurch Street», также известного как «Курительная лунка» из-за своего характерного силуэта, открыл свои двери в январе 2015 года. Идея создания открытого сада на высоте возникла в результате архитектурного конкурса. Строительство здания началось в 2010 году и завершилось в 2014 году. Открытие Скай Гардена стало значимым событием для Лондона, представляя собой новый подход к использованию городского пространства. Сад был создан с целью предоставления лондонцам и туристам уникальной возможности насладиться природой и панорамными видами на город, находясь высоко над землей. С момента своего открытия Скай Гарден стал популярным местом для отдыха, встреч и мероприятий, привлекая тысячи посетителей каждый день. Он стал символом современных тенденций в градостроительстве, подчеркивающих важность зеленых зон в урбанистических условиях.',
    architecture: 'Архитектура Скай Гардена впечатляет своим инновационным дизайном и функциональностью. Здание высотой 160 метров имеет уникальную форму, что обусловлено многочисленными террасами и уступами, которые создают эффект «плавающего» сада. Внутренние пространства распланированы так, чтобы максимально использовать свет и воздух, обеспечивая комфорт и эстетическое удовольствие. На уровне 35 этажа расположены три основные зоны: открытые террасы с зелеными насаждениями, рестораны и площадки для наблюдения. Сад площадью около 1,5 гектаров украшен более чем 1000 растительных видов, включая как местные, так и экзотические растения. Пространство также пронизано водными элементами, которые усиливают атмосферу спокойствия и умиротворенности. Архитектурные детали интерьеров выполнены из современных и экологически чистых материалов, что подчеркивает приверженность концепции устойчивого развития. Скай Гарден — это пример того, как градостроительство может взаимодействовать с природой, создавая гармоничное и привлекательное общественное пространство.'
  }
]