import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as ChristTheRedeemerImg from '@assets/images/cities/Rio_de_Janeiro/attractions/Christ_the_Redeemer'

export const ChristTheRedeemerData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Статуя Христа-Искупителя',
    image: [ChristTheRedeemerImg.Christ_the_Redeemer_1_Img, ChristTheRedeemerImg.Christ_the_Redeemer_2_Img, ChristTheRedeemerImg.Christ_the_Redeemer_3_Img, ChristTheRedeemerImg.Christ_the_Redeemer_4_Img, ChristTheRedeemerImg.Christ_the_Redeemer_5_Img],
    history: 'Статуя Христа-Искупителя, расположенная на вершине горы Корковадо в Рио-де-Жанейро, была запущена в проект в 1921 году как символ католической веры и бразильского национального духа. Идея создания памятника возникла в начале 20 века, когда в Бразилии наблюдался рост христианства и религиозных движений. Статуя, которая была спроектирована французским скульптором Полем Ландовски и построена бразильским инженером Эйтором да Силва Коштой, была завершена в 1931 году. Она быстро стала иконой Рио и важным туристическим объектом, привлекая миллионы посетителей. В 2007 году статуя была включена в список семи новых чудес света, что еще сильнее укрепило её статус.',
    architecture: 'Статуя высотой 30 метров, расположенная на постаменте в 8 метров, выполнена в неоклассическом стиле и изображает Христа, раскинувшего руки в объятии. Она изготовлена из железобетона и облицована мозаикой из каменных плит, что делает её устойчивой к погодным условиям и грибковым поражениям. Статуя символизирует мир и принятым в Бразилии прогрессивные идеи о любви и сообществе. Архитектурное оформление окружающей площади, огражденной пальмами и зелеными насаждениями, создает гармоничный ландшафт, который подчеркивает величие статуи. Примечательно, что сами размеры статуи и её расположение на высоте 700 метров над уровнем моря делают её видимой издалека, что придаёт ей ещё большую значимость как культового сооружения.'
  }
]