import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as ChristTheRedeemerImg from '@assets/images/cities/Rio_de_Janeiro/attractions/Christ_the_Redeemer'

export const ChristTheRedeemerData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Christ the Redeemer',
    address: 'Parque Nacional da Tijuca - Alto da Boa Vista, Rio de Janeiro - RJ',
    image: [ChristTheRedeemerImg.Christ_the_Redeemer_1_Img, ChristTheRedeemerImg.Christ_the_Redeemer_2_Img, ChristTheRedeemerImg.Christ_the_Redeemer_3_Img, ChristTheRedeemerImg.Christ_the_Redeemer_4_Img, ChristTheRedeemerImg.Christ_the_Redeemer_5_Img],
    description: 'Эта грандиозная статуя считается символом христианства и города. Христос протянул руки, как бы обнимая мир. Она привлекает множество туристов и почитается верующими как знак любви и надежды.',
    history: 'Статуя Христа-Искупителя, стоящая на вершине горы Корковадо в Рио-де-Жанейро, была открыта в 1931 году и стала символом города и всей Бразилии. Идея создания статуи возникла в 1850-х годах, но реальный проект стартовал только в 1921 году, когда католическая община организовала сбор средств. Статую разработали французский скульптор Поль Ландовски и инженер Ги Топрез. Она была построена в течение пяти лет и освящена 12 октября 1931 года. В 2007 году статуя стала одним из Новых семи чудес света.',
    view: 'Высота статуи составляет 30 метров, а с постаментом — 38 метров, выполнена из бетона и облицована мрамором. Скульптор Поль Ландовски и инженер Ги Топрез использовали ар-деко стиль, что проявляется в плавных линиях и гармоничных формах. Расправленные руки символизируют открытость и защиту, а пьедестал статуи служит основой, на которой Христос, олицетворяющий любовь и примирение, возвышается над городом.',
    other: 'Чтобы подняться на вершину Статуи, вам нужно приобрести билет на экскурсию. Сначала доберитесь до станции поезда Куртю-Рдже, затем воспользуйтесь фуникулёром или автобусом, который доставит вас к подножию статуи. После этого поднимитесь на лифте до смотровой площадки. На верху вы сможете насладиться невероятным видом на город. Не забудьте сделать красивые фотографии!'
  }
]