import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as CopacabanaBeachImg from '@assets/images/cities/Rio_de_Janeiro/attractions/Copacabana_Beach'

export const CopacabanaBeachData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Копакабана',
    address: 'Praia de Copacabana, Copacabana, Rio de Janeiro - RJ',
    image: [CopacabanaBeachImg.Copacabana_Beach_1_Img, CopacabanaBeachImg.Copacabana_Beach_2_Img, CopacabanaBeachImg.Copacabana_Beach_3_Img, CopacabanaBeachImg.Copacabana_Beach_4_Img, CopacabanaBeachImg.Copacabana_Beach_5_Img],
    description: 'Копакабана — одно из самых известных мест Рио-де-Жанейро, протянувшееся вдоль побережья Атлантического океана. Он славится золотистым песком, яркими пляжными будками и живой атмосферой. Здесь всегда многолюдно: туристы и местные жители наслаждаются солнечными днями, играют в волейбол и футбол. Вечером пляж превращается в оживленное место для прогулок и наслаждения закатами. Копакабана также известна своими культурными событиями и праздниками, включая знаменитый Новый год, когда тысячи людей собираются на пляже для празднования.',
    history: 'Пляж был основан в конце XIX века и быстро стал популярным местом для отдыха. Первоначально в 1892 году здесь была построена Набережная, а в 1920-х годах пляж приобрел статус мирового курорта. В 1970-х годах начинается активное развитие инфраструктуры: строятся знаменитые отели и рестораны. Копакабана стала символом карнавала и бразильской культуры, привлекая туристов своими яркими событиями и атмосферой праздника.',
    view: 'Пляж Копакабана славится не только своей красотой, но и уникальной архитектурой. Протянувшись на 4 километра, он окружен высотными зданиями, отелями и ресторанами в стиле ар-деко и неоклассицизма. На набережной выделяются черно-белые волнообразные плиточные узоры, созданные великого бразильского архитектора Роберту Бурле Маркса. Вдоль пляжа находятся знаковые сооружения, такие как форт Копакабана и знаменитый отель "Copacabana Palace". Эти элементы создают гармоничное сочетание природы и урбанистики.',
    other: 'Здесь можно снять шезлонг, насладиться коктейлем и попробовать традиционные бразильские закуски, такие как пастель и акей. Люди активно играют в пляжный волейбол и футбол, создавая динамичную атмосферу. Можно прогуляться вдоль знаменитой набережной с её характерными плитками. Вечером пляж наполняется музыкой и танцами, а закаты оставляют яркие впечатления.'
  }
]