import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as EscadariaSelaronImg from '@assets/images/cities/Rio_de_Janeiro/attractions/Escadaria_Selaron'

export const EscadariaSelaronData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Лестница Селарона',
    image: [EscadariaSelaronImg.Escadaria_Selaron_1_Img, EscadariaSelaronImg.Escadaria_Selaron_2_Img, EscadariaSelaronImg.Escadaria_Selaron_3_Img, EscadariaSelaronImg.Escadaria_Selaron_4_Img, EscadariaSelaronImg.Escadaria_Selaron_5_Img],
    history: 'Лестница Селарона — это яркий и уникальный проект, расположенный в районе Лапа в Рио-де-Жанейро. Созданная чилийским художником Хорхе Селароном, лестница была начата в 1990 году как способ преобразить заброшенное пространство и привлечь внимание к культуре и искусству Бразилии. Селарон, живущий в Бразилии с 1980 года, использовал свою лестницу как холст для самовыражения, украсив её более чем 2000 разноцветными плитками из разных стран, включая Португалию, Испанию и Японию. За годы лестница превратилась в важный культурный объект, привлекающий туристов и вдохновляющий других художников. В 2013 году, после смерти Селарона, лестница стала символом его творчества и наследия, поддерживая взаимодействие между местными жителями и туристами.',
    architecture: 'Архитектура Лестницы Селарона уникальна благодаря её ярким цветам и эклектичному стилю. Лестница длиной 215 метров состоит из 2150 плиток, каждая из которых имеет свою историю и происхождение. Плитки варьируются по размеру и форме, создавая эффект коллажа на узкой лестнице, уходящей вверх по склону холма. Основной цветовой палитрой выступают яркие оттенки зелёного, желтого и синего, символизирующие национальные цвета Бразилии, наряду с другими яркими тонами, отражающими культурное многообразие страны. Лестница обвивает несколько зданий, формируя художественную инсталляцию, которая соединяет различные уровни города. Элементы народного творчества и современного искусства делают Лестницу Селарона не только архитектурным сооружением, но и символом креативности и культурного обмена.'
  }
]