import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as SugarloafMountainImg from '@assets/images/cities/Rio_de_Janeiro/attractions/Sugarloaf_Mountain'

export const SugarloafMountainData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Сахарная голова',
    image: [SugarloafMountainImg.Sugarloaf_Mountain_1_Img, SugarloafMountainImg.Sugarloaf_Mountain_2_Img, SugarloafMountainImg.Sugarloaf_Mountain_3_Img, SugarloafMountainImg.Sugarloaf_Mountain_4_Img, SugarloafMountainImg.Sugarloaf_Mountain_5_Img],
    history: 'Сахарная голова — это одна из самых известных природных достопримечательностей Рио-де-Жанейро. Скалистая формация высотой 396 метров, расположенная на входе в залив Гуанабара, стала символом города. Название произошло от эпохи колонизации Бразилии, когда форма напоминала формы контейнеров для сахара, производимого в регионе. Появление Сахарной головы как туристического аттракциона началось в начале XX века, когда в 1912 году была открыта канатная дорога, позволяющая посетителям добираться до вершины. Со временем, Сахарная голова стала популярным местом для наблюдения за закатами и панорамного просмотра города. Площадка на вершине открывает захватывающий вид на бухту Рио, гору Корковадо и другие достопримечательности, привлекая миллионы туристов ежегодно.',
    architecture: 'Архитектура Сахарной головы представляет собой гармоничное сочетание природных и созданных человеком элементов. Основной архитектурной особенностью является канатная дорога, соединяющая вершину Сахарной головы с горой Урка. Она стала первой канатной дорогой в Латинской Америке. Одной из основных конструкций на вершине является смотровая площадка, которая оформлена изысканно, но в то же время просто, чтобы не отвлекать внимание от потрясающих вокруг видов. Само пространство вокруг Сахарной головы также благоустроено: здесь расположены прогулочные зоны, кафе и смотровые площадки. Эта гармония природной неотъемлемой красоты и современных инфраструктурных решений делает Сахарную голову культурным объектом, который привлекает внимание как местных жителей, так и туристов.'
  }
]