import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as ZaryadyeParkImage from '@images/cities/Moscow/ZaryadyePark'

export const ZaryadyeParkData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Парк Зарядье',
    image: [ZaryadyeParkImage.ZaryadyeParkImage, ZaryadyeParkImage.ZaryadyePark1Image, ZaryadyeParkImage.ZaryadyePark2Image, ZaryadyeParkImage.ZaryadyePark3Image, ZaryadyeParkImage.ZaryadyePark4Image],
    history: 'Парк Зарядье, расположенный в центре Москвы недалеко от Кремля, был открыт в 2017 году и стал одним из самых современных и масштабных общественных пространств в городе. Идея создания парка возникла в связи с сносом гостиницы "Россия", которая находилась на этом месте с 1967 года. После закрытия гостиницы в 2006 году появилась необходимость в создании нового культурного и рекреационного пространства. Проект парка был разработан международной архитектурной студией "Агентство Станков", и его реализация началась в 2015 году. Парк сочетает в себе элементы ландшафтного дизайна, инновационные технологии и культурные объекты. Он стал местом проведения различных мероприятий, выставок и концертов, а также притягательным пространством для жителей и туристов, которые ищут уединение и наслаждаются природой в сердце мегаполиса.',
    architecture: 'Архитектура Парка Зарядье представляет собой гармоничное сочетание природы и современных технологий. Комплекс включает в себя несколько уникальных зон, каждая из которых отображает различные природные ландшафты России: леса, степи, болота и тундру. Особое внимание заслуживает "Парящий мост" — пешеходная конструкция, приподнятая над землей, предлагающая потрясающий вид на Москву-реку и Кремль. Парк также включает образовательные и культурные элементы, такие как мультимедийный центр, где проводятся выставки и лекции. Ландшафтный дизайн парка сочетает в себе местные растения, создавая биологически разнообразное пространство. Архитектура Зарядья направлена на интеграцию с окружающей средой и использование устойчивых технологий, что делает его примером современного подхода к городскому благоустройству.'
  }
]