import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as ArcDeTriompheImg from '@assets/images/cities/Paris/attractions/Arc_de_Triomphe'

export const ArcDeTriompheData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Триумфальная арка',
    address: 'Pl. Charles de Gaulle, 75008 Paris, France',
    link: 'https://www.paris-arc-de-triomphe.fr/en',
    image: [ArcDeTriompheImg.Arc_de_Triomphe_1_Img, ArcDeTriompheImg.Arc_de_Triomphe_2_Img, ArcDeTriompheImg.Arc_de_Triomphe_3_Img, ArcDeTriompheImg.Arc_de_Triomphe_4_Img, ArcDeTriompheImg.Arc_de_Triomphe_5_Img],
    description: 'Триумфальная арка в Париже является одним из самых известных монументов во Франции и выдающимся примером неоклассической архитектуры. Эта величественная арка была возведена по приказу императора Наполеона Бонапарта в начале XIX века в честь побед его армии и находится на площади Шарля де Голля (ранее известной как площадь Звезды), где сходятся 12 проспектов, включая знаменитую Елисейские поля.',
    history: 'Строительство Триумфальной арки началось в 1806 году, после победы Наполеона в битве при Аустерлице, и завершилось только спустя 30 лет в 1836 году, уже при короле Луи-Филиппе. Проект был создан архитектором Жаном Шальгреном, который черпал вдохновение из римской архитектуры древности. Арка была задумана как символ военной мощи Франции и дань уважения солдатам, которые сражались за Родину.',
    view: 'Триумфальная арка имеет впечатляющие размеры: её высота составляет 50 метров, ширина - 45 метров, а глубина - 22 метра. Фасады арки украшены многочисленными барельефами и скульптурами, которые изображают важные исторические события и сцены сражений. Среди них выделяются такие произведения, как "Отправление добровольцев 1792 года" Франсуа Рюда и "Мир 1815 года" Антуана-Этекса. Внутри арки расположены 284 ступени, ведущие на смотровую площадку с великолепным видом на Париж.',
    other: 'Триумфальная арка в Париже представляет собой глубокий символ национального единства и военной славы. Это монументальная дань уважения тем, кто боролся и жертвовал своей жизнью за Францию, и напоминание о событиях, оставивших след в истории. Арка также отражает богатое культурное и архитектурное наследие Франции и продолжает вдохновлять поколения людей со всего мира своим могуществом и красотой.'
  }
]