import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as JardinDesTuileriesImg from '@assets/images/cities/Paris/attractions/Jardin_des_Tuileries'

export const JardinDesTuileriesData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Сад Тюильри',
    image: [JardinDesTuileriesImg.Jardin_des_Tuileries_1_Img, JardinDesTuileriesImg.Jardin_des_Tuileries_2_Img, JardinDesTuileriesImg.Jardin_des_Tuileries_3_Img, JardinDesTuileriesImg.Jardin_des_Tuileries_4_Img, JardinDesTuileriesImg.Jardin_des_Tuileries_5_Img],
    history: 'Сад Тюильри был создан в 1564 году по приказу Екатерины Медичи, супруги короля Генриха II. Он изначально предназначался для дополнения королевского дворца Тюильри, который находился на месте нынешнего сада. Сад был спроектирован итальянским ландшафтным дизайнером, что отразило итальянские традиции. В 17 веке он был преобразован в более французский стиль, со строгими аллеями и симметрией, характерными для барокко. В 1789 году, во время Великой французской революции, сад стал общественным пространством и открылся для посещения широкой публики. За свою историю он пережил множество преобразований и восстановлений, включая разрушения во время Второй мировой войны и восстановление после нее.',
    architecture: 'Архитектура Сада Тюильри гармонично сочетает элементы итальянского ренессанса и французского классицизма. Сад разделён на две части: восточную и западную, которые соединяются аллеей с живописными дорожками, скульптурами и фонтанами. Центральной осью является осевая линия, проходящая от площади Конкорд до Лувра. Восемь симметричных парковых зон и аллеи, выложенные плиткой, создают четкую геометрию. В саду также находятся исторические павильоны, такие как Павильон Тюильри, построенный в стиле классицизма, с характерными колоннами и монументальными фасадами. Сады оформлены разнообразными цветущими клумбами, которые меняются в зависимости от времени года, создавая яркое и притягательное пространство для посетителей. Разнообразные статуи добавляют культурное значение, подчеркивая богатую историю Франции.'
  }
]