import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as SainteChapelleImg from '@assets/images/cities/Paris/attractions/Sainte_Chapelle'

export const SainteChapelleData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Сент-Шапель',
    image: [SainteChapelleImg.Sainte_Chapelle_1_Img, SainteChapelleImg.Sainte_Chapelle_2_Img, SainteChapelleImg.Sainte_Chapelle_3_Img, SainteChapelleImg.Sainte_Chapelle_4_Img, SainteChapelleImg.Sainte_Chapelle_5_Img],
    history: 'Сент-Шапель была построена в XIII веке по приказу короля Людовика IX для хранения важнейших реликвий, включая терновый венец, который он приобрёл в Иерусалиме. Строительство началось в 1242 году и завершилось в 1248 году. Она была частью королевского дворца на острове Сите и служила местом поклонения для королевской семьи. Архитектура Сент-Шапель, один из ярчайших примеров готического стиля, впечатляет своими высокими витражами, которые занимают почти всю площадь стен. После революции часовня была преобразована в молитвенное пространство для обычных граждан. Сегодня Сент-Шапель является частью судебного комплекса, но остаётся одной из главных достопримечательностей Парижа, привлекающей множество туристов.',
    architecture: 'Сент-Шапель — яркий пример готической архитектуры, известный своими высокими витражными окнами и изящными формами. Она включает два уровня: нижний — более простой, предназначенный для общего народа, и верхний — царственный, с великолепными витражами высотой до 15 метров. Окна, изображающие библейские сцены, создают удивительную игру света и цвета. Высокие стрельчатые арки и тонкие колонны придают здания лёгкость и высоту, что характерно для готического стиля, подчеркивая божественное вдохновение.'
  }
]