import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as TourEiffelImg from '@assets/images/cities/Paris/attractions/Tour_Eiffel'

export const TourEiffelData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Эйфелева башня',
    image: [TourEiffelImg.Tour_Eiffel_1_Img, TourEiffelImg.Tour_Eiffel_2_Img, TourEiffelImg.Tour_Eiffel_3_Img, TourEiffelImg.Tour_Eiffel_4_Img, TourEiffelImg.Tour_Eiffel_5_Img],
    history: 'Строительство Эйфелевой башни началось в январе 1887 года и было завершено в марте 1889 года, всего за 26 месяцев. Башня была спроектирована выдающимся французским инженером Гюставом Эйфелем и его компанией для Всемирной выставки 1889 года, которая проводилась в Париже по случаю столетия Французской Революции. Первоначально башня вызвала смешанные реакции среди парижан, многие из которых считали её неэстетичной и излишне массивной. Однако, со временем, она стала синонимом архитектурного мастерства и инноваций.',
    architecture: 'Эйфелева башня была настоящим инженерным подвигом своего времени. Её конструкция состоит из 18 038 индивидуальных железных частей, соединенных более чем двумя с половиной миллионами заклепок. Башня имеет три уровня для посещения. Первый и второй уровень включают рестораны с панорамными видами, а третий уровень, который считается смотровой площадкой, предлагает потрясающие виды на Париж с высоты 276 метров.'
  }
]