import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as SupertreeGroveImage from '@images/cities/Singapore/SupertreeGrove'

export const SupertreeGroveData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Роща сверхдеревьев',
    image: [SupertreeGroveImage.SupertreeGroveImage, SupertreeGroveImage.SupertreeGrove1Image, SupertreeGroveImage.SupertreeGrove2Image, SupertreeGroveImage.SupertreeGrove3Image, SupertreeGroveImage.SupertreeGrove4Image],
    history: 'Роща сверхдеревьев — уникальная часть ботанического сада Gardens by the Bay в Сингапуре, открывшаяся в 2012 году. Проект был задуман в рамках программы по превращению Сингапура в "город-сад", и его цель заключалась в гармоничном сочетании природы и технологий. Вдохновленные природой, дизайнеры из компании Grant Associates создали 18 "супердеревьев", высота которых достигает 50 метров. Эти конструкции являются не просто архитектурными объектами, но и экосистемами, встраиваемыми в окружающую среду. Supertree Grove способен генерировать солнечную энергию и собирать дождевую воду, что делает его частью устойчивого ландшафта города. Кроме того, здесь проводятся различные культурные мероприятия и праздники, что делает рощу центром общественной жизни, привлекающим как местных жителей, так и туристов со всего мира.',
    architecture: 'Архитектура Supertree Grove представляет собой впечатляющий синтез природы и технологий. Каждое "супердерево" создано из стальных каркасов, обвитых растительностью, что придаёт им органичный вид. Эти конструкции не только визуально напоминают настоящие деревья, но и выполняют множество функций: некоторые из них являются домом для редких видов растений, а также служат модулями для сбора солнечной энергии и системы управления дождевой водой. На высоте 22 метра расположена "Cloud Walk" — пешеходный мост, предлагающий великолепный вид на весь парк и окрестности. По вечерам роща становится площадкой для светового шоу, где фонари и музыка создают волшебную атмосферу. Эта гармония архитектуры и природы делает Supertree Grove не только визуальной достопримечательностью, но и символом устойчивого развития Сингапура.'
  }
]