import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as CloudForestImage from '@images/cities/Singapore/CloudForest'

export const CloudForestData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Облачный лес',
    image: [CloudForestImage.CloudForestImage, CloudForestImage.CloudForest1Image, CloudForestImage.CloudForest2Image, CloudForestImage.CloudForest3Image, CloudForestImage.CloudForest4Image],
    history: 'Облачный лес в Сингапуре — это одно из самых впечатляющих современных сооружений, который входит в состав сада Gardens by the Bay. Открытый в 2012 году, этот комплекс создан с целью демонстрации разнообразия экосистем и посвящён важности охраны окружающей среды. Облачный лес занимает площадь около 0,8 гектара и представляет собой огромный стеклянный купол, внутри которого воссозданы условия тропических лесов. Здесь можно увидеть множество редких растений, а также 35-метровый искусственный водопад, что создаёт атмосферу настоящего тропического рая. Концепция проекта основана на идее интеграции природы и технологий, что является важной частью устойчивого развития городов. Облачный лес стал символом экологической устойчивости и привлекает туристов со всего мира.',
    architecture: 'Архитектура Облачного леса воплощает в себе современный подход к устойчивому дизайну. Купол был спроектирован студией Grant Associates и архитектурным бюро Wilkinson Eyre Architects. Он выполнен из стеклянных и металлических конструкций, позволяющих максимально использовать солнечный свет и снизить потребление энергии. Стеклянные панели обеспечивают хорошую вентиляцию и естественное освещение, что способствует развитию экосистемы внутри. Минималистичный и органический дизайн отражает формы естественной природы, с плавными линиями и многоуровневыми террасами. Использование современных технологий, таких как «умные» системы управления климатом и автоматизированное поливное оборудование, помогает поддерживать оптимальные условия для растений. Облачный лес стал не только архитектурной достопримечательностью, но и примером того, как можно гармонично сочетать природу и технологии в урбанистическом пространстве.'
  }
]