import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as LouvreImage from '@images/cities/Paris/Louvre'

export const LouvreData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Лувр',
    image: [LouvreImage.LouvreImage, LouvreImage.Louvre1Image, LouvreImage.Louvre2Image, LouvreImage.Louvre3Image, LouvreImage.Louvre4Image],
    history: 'Лувр, расположенный в сердце Парижа, имеет богатую и многоуровневую историю, начавшуюся в XII веке. Первоначально он был построен как крепость для защиты города от викингов. В XIV веке король Филипп IV решил превратить его в королевскую резиденцию. В XVI веке под королем Франциском I Лувр стал дворцом в Ренессансном стиле, и его архитектура продолжала меняться вплоть до XVIII века, когда Людовик XIV переместил королевский двор в Версаль. В 1793 году, во время Французской революции, Лувр был открыт для публики как музей. С тех пор он стал одним из самых известных музеев мира, вмещая более 35 000 произведений искусства, включая знаменитые полотна, такие как "Мона Лиза" и "Венера Милосская". Лувр прошел через множество реконструкций и расширений, включая строительство стеклянной пирамиды в 1989 году, которая стала символом современного Лувра.',
    architecture: 'Архитектура Лувра представляет собой уникальное сочетание стилей, отражающее различные исторические эпохи. Первоначально, как крепость Филиппа II, Лувр имел простые оборонительные стены и башни. С XV века началась его трансформация в королевский дворец: архитекторы, такие как Пьер Леско и Клод Перро, добавляли элементы Ренессанса, включая богатые фасады и внутренние дворы с колоннадами. В XVII-XVIII веках Лувр продолжал развиваться благодаря правлению Людовиков. В это время к дворцу были добавлены величественные галереи и крытые дворы, такие как курдонер. Современная архитектурная интервенция началась с создания стеклянной пирамиды И. М. Пэя, которая стала современным входом в музей. Пирамида не только символизирует связь между историей и современностью, но и обеспечивает светлое пространство внутри, внося свежесть в классическую архитектуру. Лувр является не только музеем, но и шедевром архитектурного искусства, где старина гармонично сосуществует с современными элементами.'
  }
]