import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as CentralParkImage from '@images/cities/NewYork/CentralPark'

export const CentralParkData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Центральный парк',
    image: [CentralParkImage.CentralParkImage, CentralParkImage.CentralPark1Image, CentralParkImage.CentralPark2Image, CentralParkImage.CentralPark3Image, CentralParkImage.CentralPark4Image],
    history: 'Центральный парк в Нью-Йорке был открыт в 1858 году и стал первым запланированным городским парком в США. Идея создания парка возникла в условиях стремительного роста города, когда возникла необходимость предоставить жителям зеленые пространства для отдыха и досуга. В 1853 году городские власти выделили 340 гектаров земли для строительства парка. Конкурс на проект парка выиграли Фредерик Олмстед и Калверт Вокс. Их план предусматривал создание живописных ландшафтов с искусственными озерами, аллеями и садами. Строительство парка было сложным процессом, включающим выкорчевку деревьев и формирование ландшафта – в результате он стал прекрасным образцом паркового искусства того времени. Открытие парка в 1858 году стало значимым событием, и с тех пор он становится культурным и социальным центром города, предлагая жителям и туристам разнообразные возможности для отдыха и развлечений.',
    architecture: 'Созданный в стиле романтизма, парк сочетает в себе природные ландшафты, искусственные сооружения и элементы пейзажного дизайна. Архитекторы создали многоуровневую структуру, включая холмы, озера, мосты и лестницы. Одной из главных особенностей является искусственное озеро, образованное благодаря тщательному управлению природными водными ресурсами. В Центральном парке расположено множество архитектурных элементов, таких как знаменитый мост Bow Bridge, который выполнен в стиле неоготики, и множество уютных беседок, которые гармонично вписываются в окружающий ландшафт. Так же стоит отметить «Холмы Рамсей» и «Долина Спокойствия», которые создают атмосферу уединения. Особое внимание уделяется выборам растительности, которая меняется в зависимости от времени года, создавая незабываемое зрительное восприятие. Центральный парк является не только местом для отдыха, но и архитектурным шедевром, который демонстрирует художественную и экологическую гармонию.'
  }
]