import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as ColosseumImage from '@images/cities/Rome/Colosseum'

export const ColosseumData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Колизей',
    image: [ColosseumImage.ColosseumImage, ColosseumImage.Colosseum1Image, ColosseumImage.Colosseum2Image, ColosseumImage.Colosseum3Image, ColosseumImage.Colosseum4Image],
    history: 'Колизей, или Флавиев амфитеатр, был построен в Риме в I веке н. э. по указу императора Веспасиана, который начал строительство в 70 году. Окончание строительства состоялось в 80 году при его сыне Тите. Колизей стал символом мощи Римской империи и предназначался для гладиаторских боев, театрализованных представлений и других зрелищ. Он вмещал до 50 000 зрителей и был окружен множеством легенд и историй, включая рассказ о первых гладиаторских боях. Однако с падением Римской империи Колизей пришел в упадок. В средние века он использовался как жилой комплекс, мастерская, святыня и даже крепость. Восстановление началось в XVI веке, и в наше время Колизей стал важным культурным символом, привлекающим туристов со всего мира и представляя собой знаковую достопримечательность Рима.',
    architecture: 'Архитектура Колизея является выдающимся примером древнеримского инженерного искусства. Он построен из бетонных блоков и камня, с использованием арок и сводов, что обеспечивает устойчивость и прочность конструкции. Колизей имеет эллиптическую форму, длина которого составляет около 189 метров, а ширина — около 156 метров. Высота здания достигает 48 метров. Внешние стены украшены колоннами разных стилей: коринфским, ионическим и тосканским, что свидетельствует о мастерстве римских архитекторов. Внутри Колизея были пропускные проходы и уровни для зрителей, обеспечивавшие удобный доступ. Крыша, которая когда-то покрывала арену, могла быть оснащена специальным навесом для защиты зрителей от солнца. Все это делает Колизей не только архитектурным ансамблем, но и функциональной структурой, специально спроектированной для массовых зрелищ.'
  }
]