import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as RijksmuseumImage from '@images/cities/Amsterdam/Rijksmuseum'

export const RijksmuseumData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Рейксмузеум',
    image: [RijksmuseumImage.RijksmuseumImage, RijksmuseumImage.Rijksmuseum1Image, RijksmuseumImage.Rijksmuseum2Image, RijksmuseumImage.Rijksmuseum3Image, RijksmuseumImage.Rijksmuseum4Image],
    history: 'Рейксмузеум, был основан в 1800 году как Национальный музей Нидерландов. Первоначально он находился в Гааге, но в 1808 году был перенесён в Амстердам. С 1885 года музей располагается в современном здании, спроектированном архитектором Питером Кёйперсом. Он стал символом голландского искусства и культуры, хранящим богатую коллекцию, в которой представлены работы великих мастеров, таких как Рембрандт и Вермеер. Рейксмузеум переживал различные этапы, включая реконструкцию в начале XXI века, которая завершилась в 2013 году, что позволило музею обновить выставочные пространства и улучшить условия для посетителей. Сегодня Рейксмузеум является одним из самых посещаемых музеев мира и важнейшим центром культурной жизни Нидерландов.',
    architecture: 'Здание выполнено в неоготическом стиле, что сделало Рейксмузеум выдающимся примером архитектуры XIX века. Фасад музея украшен белым и красным кирпичом, а также характерными для этого стиля элементами, такими как высокие арки и башенки. Центральная часть здания завершается величественной колоннады, которая открывает вход и приглашает посетителей войти. Внутренние пространства музея также впечатляют, с широкими галереями и высокими потолками, украшенными художественными росписями. Реконструкция, завершённая в 2013 году, сохранила исторические элементы и добавила современные удобства, такие как стеклянные галереи, которые позволяют естественному свету заполнить помещения.'
  }
]