import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as DeWallenImage from '@images/cities/Amsterdam/DeWallen'

export const DeWallenData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Де Валлен',
    image: [DeWallenImage.DeWallenImage, DeWallenImage.DeWallen1Image, DeWallenImage.DeWallen2Image, DeWallenImage.DeWallen3Image, DeWallenImage.DeWallen4Image],
    history: 'Де Валлен — старейший район Амстердама, известный своей историей и культурным наследием. Он возник в 14 веке как часть городской защиты, с укреплениями и каналами, которые обеспечивали безопасность города. В 16 веке Де Валлен стал центром торговли и коммерции, привлекая купцов со всего мира. Однако, начиная с 19 века, район столкнулся с изменениями. Он известен своей открытой культурой, но также стал центром красных фонарей, что привело к стереотипам и неоднозначному восприятию. В последние десятилетия власти начали работу по восстановлению района, акцентируя внимание на его исторической ценности и культурных памятниках. Сегодня Де Валлен сочетает в себе уникальную архитектуру, оживленные улицы и богатое культурное наследие, привлекая туристов и позволяя понять многогранность истории Амстердама.',
    architecture: 'Архитектура района Де Валлен обогащает его уникальную атмосферу. Узкие улочки и уютные каналы, огибающие дома, создают соблазнительный антураж старины. Здесь можно увидеть традиционные амстердамские домики, построенные в стиле голландского ренессанса, с характерными фасадами, высокими окнами и наклонными крышами. Многие здания, датируемые 16-17 веками, сохранили свою оригинальную отделку, включая декоративные элементы и вывески. Важной частью архитектурного наследия являются церкви, такие как Oude Kerk — старейшая церковь города, с готическим стилем и впечатляющей колокольней. Кроме того, в районе можно найти и современные элементы, что создает интересный контраст между прошлым и настоящим. Архитектура Де Валлен отражает культурные и исторические изменения, происходившие в Амстердаме на протяжении веков, сохраняя при этом атмосферу уникального и живого места.'
  }
]