import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as MoscowCityImage from '@images/cities/Moscow/MoscowCity'

export const MoscowCityData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Москва-Сити',
    image: [MoscowCityImage.MoscowCityImage, MoscowCityImage.MoscowCity1Image, MoscowCityImage.MoscowCity2Image, MoscowCityImage.MoscowCity3Image, MoscowCityImage.MoscowCity4Image],
    history: 'Москва-Сити, также известный как Московский международный деловой центр, представляет собой современный деловой район, который начал формироваться в конце 1990-х годов. Идея создания этого комплекса возникла в ответ на потребность в новых офисных пространствах и развитии финансовых услуг в России. Строительство первых зданий началось в 1996 году, и с тех пор район активно развивался. В 2004 году был утвержден генеральный план, который включал в себя создание многофункционального комплекса с офисами, жилыми и гостиничными помещениями. К 2010 году Москва-Сити стал одним из самых высоких и современных деловых центров Европы, с такими знаковыми зданиями, как Башня Федерация и Восточная башня. Сегодня Москва-Сити является важным финансовым и деловым узлом, привлекающим как отечественные, так и международные компании.',
    architecture: 'Архитектура Москва-Сити представляет собой яркий пример современного градостроительства и инновационного дизайна. Комплекс включает в себя множество небоскребов, каждый из которых имеет уникальный стиль и форму. Одним из самых высоких зданий является Башня Федерация, высота которой достигает 373 метров. Архитектурные решения зданий варьируются от стеклянных фасадов до сложных геометрических форм, что создает впечатляющий городской пейзаж. В районе также расположены такие здания, как "Восточная башня" и "Московская башня", которые отличаются современными технологиями и экологическими решениями. Архитектурный ансамбль Москва-Сити гармонично сочетает в себе элементы футуризма и функциональности, что делает его одним из самых привлекательных мест для бизнеса и жизни в Москве.'
  }
]