import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as WestminsterAbbeyImage from '@images/cities/London/WestminsterAbbey'

export const WestminsterAbbeyData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Вестминстерское аббатство',
    image: [WestminsterAbbeyImage.WestminsterAbbeyImage, WestminsterAbbeyImage.WestminsterAbbey1Image, WestminsterAbbeyImage.WestminsterAbbey2Image, WestminsterAbbeyImage.WestminsterAbbey3Image, WestminsterAbbeyImage.WestminsterAbbey4Image],
    history: 'Вестминстерское аббатство, основанное в 960 году, изначально было небольшим монастырем. Однако под руководством короля Эдуарда Исповедника в начале XI века оно стало местом коронации и захоронения английских монархов. В 1065 году Эдвард заключил его в камень, чтобы создать величественный храм, и уже в 1066 году здесь был коронован Вильгельм Завоеватель. С тех пор аббатство стало величественным центром английской королевской власти: здесь проходили коронации, свадьбы и похороны монархов. В течение веков здание подвергалось различным изменениям и реставрациям, особенно в стиле готики, который был добавлен в XII-XIII веках. В XIX веке аббатство было кардинально восстановлено. Сегодня Вестминстерское аббатство является памятником наследия и привлекает множество туристов, а также остается действующим местом поклонения и церемоний.',
    architecture: 'Архитектура Вестминстерского аббатства представляет собой выдающийся пример готического стиля. Основная структура здания, выполненная из известняка, сочетает в себе элементы романского и готического архитектурных направлений. Главный фасад украшен великолепными арками, витражами и скульптурами, создавая величественное первое впечатление. Центральный неф имеет впечатляющую высоту и характеризуется красивыми ребристыми сводами и высокими окнами, пропускающими свет и создающими атмосферу святости. Внутреннее убранство включает в себя множество капелл, каждая из которых достойна отдельного внимания. Среди них — Капелла Генриха VII, украшенная резьбой по дереву и витражами. Невыразимое чувство возвышенности создается доходящей до небес колоннады и роскошным декором. Архитектура аббатства не только отражает богатую историю, но и является символом английской культуры, вдохновляя архитекторов всего мира.'
  }
]