import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as PiazzaNavonaImage from '@images/cities/Rome/PiazzaNavona'

export const PiazzaNavonaData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Пьяцца Навона',
    image: [PiazzaNavonaImage.PiazzaNavonaImage, PiazzaNavonaImage.PiazzaNavona1Image, PiazzaNavonaImage.PiazzaNavona2Image, PiazzaNavonaImage.PiazzaNavona3Image, PiazzaNavonaImage.PiazzaNavona4Image],
    history: 'Пьяцца Навона — одна из самых известных площадей Рима, чей путь начался еще в I веке н. э. В античные времена на этом месте находился стадион Домициана, где проводились спортивные соревнования и праздники. После падения Римской империи стадион пришел в упадок, и его руины стали основой для нового городского пространства. В 15 веке площадь начала трансформироваться, когда к ней начали строить красивые здания и фонтаны. В 17 веке, под руководством папы Иннокентия X, Пьяцца Навона приобрела свой современный вид, став центром общественной жизни. В 19 веке площадь стала местом проведения ярмарок и праздников. Сегодня Пьяцца Навона привлекает толпы туристов благодаря своему живописному раскрепощенному духу, ярким кафе и уличным артистам, сохраняя при этом свою историческую самобытность.',
    architecture: 'Архитектурный облик Пьяцца Навона формировался веками, отражая стили разных эпох. Центральным элементом площади является фонтан Четырех рек, созданный знаменитым скульптором Бернини в 1651 году. Его статуи представляют четыре великих реки: Ганг, Нил, Ла Плата и Дунай, символизируя четыре континента. Вокруг площади расположены великолепные здания, такие как церковь Санта-Аньезе ин Агоне, разработанная архитектором Боромини, бывшая резиденция семьи Памфили. Площадь окружена красивыми барочными фасадами, которые придают ей величественный вид. Благодаря фонтанам и скульптурам, Пьяцца Навона выглядит как открытый музей, где история и искусство переплетаются, привлекая внимание художников и туристов со всего мира.'
  }
]