import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as MarinaBaySandsImage from '@images/cities/Singapore/MarinaBaySands'

export const MarinaBaySandsData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Марина Бей Сендс',
    image: [MarinaBaySandsImage.MarinaBaySandsImage, MarinaBaySandsImage.MarinaBaySands1Image, MarinaBaySandsImage.MarinaBaySands2Image, MarinaBaySandsImage.MarinaBaySands3Image, MarinaBaySandsImage.MarinaBaySands4Image],
    history: 'Marina Bay Sands — один из самых знаковых архитектурных проектов Сингапура, открытый в 2010 году. Идея создания курортного комплекса принадлежит компании Las Vegas Sands, которая выиграла конкурс по разработке концепции возрождения района Marina Bay. Этот проект стал частью государственной инициативы по преобразованию Сингапура в всемирный центр туризма и бизнеса. Строительство началось в 2007 году и обошлось в около 5,7 миллиарда долларов, что делает его одним из самых дорогих отелей в мире. Marina Bay Sands быстро завоевал популярность благодаря своему роскошному стилю, уникальным аттракционам, таким как Infinity Pool — самый большой плавательный бассейн на крыше, и SkyPark с потрясающим видом на город. С момента открытия комплекс стал магнитом для туристов, предлагая не только отель, но и казино, торговый центр, театры и музеи, что изменило городской ландшафт и экономику Сингапура.',
    architecture: 'Архитектура Marina Bay Sands — это выдающийся пример современного дизайна. Комплекс состоит из трех небоскребов, связываемых уникальным SkyPark, который располагается на высоте 200 метров. Небоскребы достигают высоты 207 метров и имеют по 55 этажей. Одна из самых заметных особенностей Marina Bay Sands — это своего рода "платформа" на крыше, которая напоминает корабль, располагающийся на вершине зданий. Архитектор Моше Сафди использовал концепцию, символизирующую слияние природы и урбанистической среды. Фасады зданий выполнены из стеклянных панелей, что обеспечивает великолепный вид на город и залив. Кроме того, в комплексе предусмотрены террасы с садами, что придаёт ему экологическую гармонию. С учетом уникальной формы и конструктивных решений, Marina Bay Sands стал не только важным архитектурным достижением, но и символом инновативного подхода Сингапура к городской архитектуре.'
  }
]