import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as TreviFountainImage from '@images/cities/Rome/TreviFountain'

export const TreviFountainData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Фонтан Треви',
    image: [TreviFountainImage.TreviFountainImage, TreviFountainImage.TreviFountain1Image, TreviFountainImage.TreviFountain2Image, TreviFountainImage.TreviFountain3Image, TreviFountainImage.TreviFountain4Image],
    history: 'Фонтан Треви, расположенный в Риме, является одним из самых известных фонтанов в мире. Его история начинается в 1732 году, когда папа Климент XII решил создать новый фонтан на месте старого, который был построен в 1629 году. Архитектор Никола Сальви выиграл конкурс на проектирование нового фонтана, и его работа была завершена в 1762 году. Центральной фигурой является Нептун, бог моря, который управляет морскими водами. Фонтан также известен своей величественной архитектурой и впечатляющими водными эффектами. Согласно традиции, бросая монету через левое плечо в фонтан, туристы обеспечивают себе возвращение в Рим. Каждый год в фонтане собираются миллионы евро, которые затем передаются на благотворительность.',
    architecture: 'Фонтан Треви, шедевр барочной архитектуры, поражает своей грандиозностью и изяществом. Фонтан имеет форму полукруга, а его центральной фигурой является Нептун, окруженный скульптурами, символизирующими морские стихии и водные потоки. Архитектурные элементы фонтанов включают колонны, пилястры и декоративные барельефы, которые придают ему величественный вид. Вода, струящаяся из различных источников, создает эффект динамики и живости, а подсветка в вечернее время подчеркивает красоту скульптур. Фонтан выполнен из травертина, что придает ему теплый оттенок и гармонирует с окружающей архитектурой Рима. Фонтан Треви стал не только архитектурным символом города, но и важной частью его культурного наследия, привлекая миллионы туристов, которые восхищаются его красотой и историей.'
  }
]