import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as BrooklynBridgeImg from '@assets/images/cities/New_York/attractions/Brooklyn_Bridge'

export const BrooklynBridgeData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Бруклинский мост',
    image: [BrooklynBridgeImg.Brooklyn_Bridge_1_Img, BrooklynBridgeImg.Brooklyn_Bridge_2_Img, BrooklynBridgeImg.Brooklyn_Bridge_3_Img, BrooklynBridgeImg.Brooklyn_Bridge_4_Img, BrooklynBridgeImg.Brooklyn_Bridge_5_Img],
    history: 'Бруклинский мост, открытый в 1883 году, стал первым подвесным мостом из стали. Его строительство было начато в 1869 году под руководством инженера Джона А. Рёблинга, но после его смерти работу продолжил его сын Вашингтон Рёблинг. Строительство было сложно, с многочисленными трудностями и жертвами, включая самого Вашингтона, пострадавшего от кесонной болезни. Мост соединил Манхэттен и Бруклин, символизируя прогресс и инновации, и стал важнейшей транспортной артерией и туристической достопримечательностью Нью-Йорка.',
    architecture: 'Бруклинский мост — выдающийся пример готической архитектуры и инженерного мастерства XIX века. Мост является подвесным, с двумя неоготическими гранитными башнями, каждая из которых достигает высоты 84 метров. Башни поддерживают сеть из стальных тросов, соединённых через массивные анкерные плиты. Главный пролёт длиной 486 метров был самым длинным в мире на момент завершения строительства. Архитектурные элементы башен, как стрельчатые арки, придают мосту величественный и монументальный вид, гармонично сочетая эстетику и функциональность.'
  }
]