import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as BrooklynBridgeImg from '@assets/images/cities/New_York/attractions/Brooklyn_Bridge'

export const BrooklynBridgeData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Бруклинский мост',
    address: 'Brooklyn Bridge, New York, NY 10038',
    link: 'https://www.nyc.gov/html/dot/html/infrastructure/brooklyn-bridge.shtml',
    image: [BrooklynBridgeImg.Brooklyn_Bridge_1_Img, BrooklynBridgeImg.Brooklyn_Bridge_2_Img, BrooklynBridgeImg.Brooklyn_Bridge_3_Img, BrooklynBridgeImg.Brooklyn_Bridge_4_Img, BrooklynBridgeImg.Brooklyn_Bridge_5_Img],
    description: 'Один из самых узнаваемых символов Нью-Йорка, соединяет Манхэттен и Бруклин через Ист-Ривер. Открытый в 1883 году, он был первым подвесным мостом из стали. Прогулка по мосту дает потрясающий вид на Манхэттенский горизонт и Статую Свободы. Мост длиной около 1825 метров имеет как пешеходную, так и велосипедную дорожки.',
    history: 'Бруклинский мост, открытый в 1883 году, стал первым подвесным мостом из стали. Его строительство было начато в 1869 году под руководством инженера Джона А. Рёблинга, но после его смерти работу продолжил его сын Вашингтон Рёблинг. Строительство было сложно, с многочисленными трудностями и жертвами, включая самого Вашингтона, пострадавшего от кесонной болезни. Мост соединил Манхэттен и Бруклин, символизируя прогресс и инновации, и стал важнейшей транспортной артерией и туристической достопримечательностью Нью-Йорка.',
    view: 'Бруклинский мост — выдающийся пример готической архитектуры и инженерного мастерства XIX века. Мост является подвесным, с двумя неоготическими гранитными башнями, каждая из которых достигает высоты 84 метров. Башни поддерживают сеть из стальных тросов, соединённых через массивные анкерные плиты. Главный пролёт длиной 486 метров был самым длинным в мире на момент завершения строительства. Архитектурные элементы башен, как стрельчатые арки, придают мосту величественный и монументальный вид, гармонично сочетая эстетику и функциональность.',
    other: 'Мост сыграл ключевую роль в объединении Манхэттена и Бруклина, дважды ускорив экономическое и социальное развитие Нью-Йорка. Это инженерное чудо стало символом американского прогресса и промышленной революции, вдохновляя архитекторов и инженеров по всему миру. Мост улучшил транспортное сообщение, способствовал росту населения и изменил городскую динамику. Сегодня он символизирует связь между прошлым и будущим, оставаясь иконой городской инфраструктуры и популярным туристическим объектом.'
  }
]