import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as CentralParkImg from '@assets/images/cities/New_York/attractions/Central_Park'

export const CentralParkData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Центральный парк',
    address: '59th 110th St · Manhattan, NY 10019',
    link: 'https://www.centralparknyc.org',
    image: [CentralParkImg.Central_Park_1_Img, CentralParkImg.Central_Park_2_Img, CentralParkImg.Central_Park_3_Img, CentralParkImg.Central_Park_4_Img, CentralParkImg.Central_Park_5_Img],
    description: 'Одно из самых известных и посещаемых общественных парков в мире. Занимая площадь в 843 акра (около 341 гектара), Центральный парк является зеленым оазисом в сердце одного из самых оживленных мегаполисов.',
    history: 'Центральный парк создан в 1857 году как первый ландшафтный общественный парк в США. Проект разработали Фредерик Лоу Олмстед и Калверт Вокс. Первоначально предназначенный для оздоровления и отдыха, парк стал важным культурным и социальным центром. Первые участки открылись в 1858 году, а к 1876 году завершены основные работы. Сегодня парк служит популярным местом отдыха для миллионов жителей и туристов.',
    view: 'Центральный парк включает в себя разнообразные ландшафтные зоны: поля, лесопарковые зоны, водоемы и искусственные холмы. В парке расположено несколько озер и прудов, включая Центральное озеро (The Lake) и Японский пруд (The Pond). Более 93 километров (58 миль) пешеходных дорожек, велосипедных дорожек и дорожек для верховой езды.',
    other: 'Американский музей естественной истории: Расположен на западной стороне парка, знаменитый музейный комплекс, включающий планетарий и обширные коллекции по естественной истории. Зоопарк Центрального парка: Разделен на несколько тематических зон, обитатели которых представляют разные климатические пояса мира. Бетесда-Терраса и Фонтан: Одна из центральных архитектурных композиций парка, включающая живописный фонтан с ангелом Бетесды. Консерватория водоемов: Система декоративных прудов и водных садов, где находятся лодочные станции и павильон. Шекспировский сад и театр "Делакорт": Красивый сад и открытый театр, где проходят летние постановки Шекспировских пьес в рамках программы "Лето в парке".'
  }
]