import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as EmpireStateBuildingImg from '@assets/images/cities/New_York/attractions/Empire_State_Building'

export const EmpireStateBuildingData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Empire State Building',
    address: '20 W 34th St., New York, NY 10001',
    link: 'https://www.esbnyc.com',
    image: [EmpireStateBuildingImg.Empire_State_Building_1_Img, EmpireStateBuildingImg.Empire_State_Building_2_Img, EmpireStateBuildingImg.Empire_State_Building_3_Img, EmpireStateBuildingImg.Empire_State_Building_4_Img, EmpireStateBuildingImg.Empire_State_Building_5_Img],
    description: 'Это один из самых известных и символичных небоскрёбов в мире, расположенный в центре Манхэттена, Нью-Йорк. Empire State Building стал символом Нью-Йорка и американской инженерной мысли. Здание часто используется в кинофильмах, телепередачах и литературе как культовый элемент городской архитектуры. Посещение Empire State Building — это незабываемый опыт, предоставляющий уникальный взгляд на Нью-Йоркский пейзаж и историю.',
    history: 'Строительство началось 17 марта 1930 года и завершилось 11 апреля 1931 года, продлившись всего 13 месяцев, что на тот момент было выдающимся достижением. Проект был разработан архитектурной фирмой Shreve, Lamb & Harmon. Официально здание открыли 1 мая 1931 года, и оно сразу же стало самым высоким зданием в мире, удерживая этот титул до 1970 года, когда его превзошли башни Всемирного торгового центра.',
    view: 'Здание выполнено в стиле ар-деко, который был популярен в начале 20-го века и характеризуется элегантными формами и орнаментальными элементами. Общая высота: 443,2 метра, включая антенну. Высота крыши здания: 381 метра. Общее количество этажей — 102. Один из характерных аспектов здания — его вечернее освещение. Цвет подсветки меняется в зависимости от праздников, событий и специальных мероприятий.',
    other: 'Здание славится своими смотровыми площадками. 86-й этаж: Открытая смотровая площадка с панорамным видом на город (обеспечивает 360-градусный обзор). 102-й этаж: Закрытая смотровая площадка с ещё более захватывающими видами. В холлах небоскрёба также находятся магазины, рестораны и музеи, рассказывающие историю здания. Обсерватории открыты ежедневно, причем часы работы могут варьироваться в зависимости от сезона. Обычно они работают с 8 утра до 2 ночи. Билеты можно приобрести как онлайн через официальный сайт, так и на месте. Существуют различные типы билетов, включая билеты на обе смотровые площадки и "экспресс-проход". Для обеспечения безопасности и удобства посетителей в здании предусмотрены современные системы безопасности и лифты, обеспечивающие быстрый доступ на верхние этажи.'
  }
]