import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as GrandCentralTerminalImg from '@assets/images/cities/New_York/attractions/Grand_Central_Terminal'

export const GrandCentralTerminalData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Grand Central Terminal',
    address: '89 East 42nd Street Manhattan, New York City',
    link: 'https://grandcentralterminal.com',
    image: [GrandCentralTerminalImg.Grand_Central_Terminal_1_Img, GrandCentralTerminalImg.Grand_Central_Terminal_2_Img, GrandCentralTerminalImg.Grand_Central_Terminal_3_Img, GrandCentralTerminalImg.Grand_Central_Terminal_4_Img, GrandCentralTerminalImg.Grand_Central_Terminal_5_Img],
    description: 'Это великолепный железнодорожный терминал, расположенный в Нью-Йорке, открытый в 1913 году. Он известен своим архитектурным стилем и потрясающим главным залом с росписью звёздного неба на потолке. Внутри находятся величественные мраморные покрытия, витражи и резные детали. Терминал также предлагает множество магазинов и ресторанов, что делает его не только транспортным узлом, но и культурной достопримечательностью.',
    history: 'Терминал был открыт в 1913 году и стал символом архитектурного величия Нью-Йорка. Первоначально на этом месте находилась станция Grand Central Depot, открытая в 1871 году. Новое здание, спроектированное архитекторами Грантом Уорреном и Чарльзом Стэмом в стиле Beaux-Arts, впечатлило своим главным залом с звёздным небом на потолке. В 1960-х годах возникли угрозы сноса терминала, но благодаря усилиям защитников исторического наследия он был признан национальным памятником в 1975 году. Реставрация в 1990-х годах возвратила терминалу его былую славу. Сегодня он активно функционирует и привлекает миллионы туристов.',
    view: 'Grand Central Terminal — выдающийся пример архитектуры в стиле Beaux-Arts. Главный зал терминала, шириной 37 метров и высотой 30 метров, покрыт великолепным звёздным небом, выполненным в виде росписи по гипсу. Внутренние стены отделаны мрамором различных оттенков, включая зелёный и белый. Уникальные детали, такие как резные колонны и витражи, создают атмосферу величия и величественности. Кроме того, знаменитая огромная круглые часы на центре терминала добавляют ему шарма и служат знаковым элементом.',
    other: 'Терминал играет ключевую роль в транспортной системе Нью-Йорка, функционируя как важный пересадочный узел для миллионов пассажиров, использующих метро и железные дороги. Его значение выходит за рамки простого транзита, терминал является символом архитектурного наследия города и культурной жизни. Он привлекает туристов своим великолепием и историей, служит местом для выставок и мероприятий. Благодаря своей уникальной атмосфере и удобствам, терминал объединяет людей, сохраняя свою роль как важного социального и экономического пространства в сердце мегаполиса.'
  }
]