import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as TimesSquareImg from '@assets/images/cities/New_York/attractions/Times_Square'

export const TimesSquareData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Таймс-сквер',
    image: [TimesSquareImg.Times_Square_1_Img, TimesSquareImg.Times_Square_2_Img, TimesSquareImg.Times_Square_3_Img, TimesSquareImg.Times_Square_4_Img, TimesSquareImg.Times_Square_5_Img],
    history: 'Таймс-сквер, расположенный в сердце Манхэттена, Нью-Йорка, изначально был известен как "Лонгакр-сквер" и был переименован в 1904 году в честь газеты "The New York Times", которая открыла свои новые офисы в одном из зданий на площади. С самого начала XX века Таймс-сквер стал центром городской жизни, привлекая внимание многочисленных туристов и местных жителей. В 1920-е годы, в эпоху джаза, площадь превратилась в центр развлечений, кино и театра. Период Великой депрессии в 1930-е годы и последующие годы не смогли остановить её рост. Таймс-сквер стал символом Америки, особенно благодаря своим ярким неоновым вывескам и паркам. В 1980-х годах Таймс-сквер столкнулся с проблемами, связанными с преступностью и упадком, но в 1990-х годах началась большая реконструкция, и площадь снова обрела свою привлекательность. Сегодня Таймс-сквер является одним из самых посещаемых мест в мире, известным своими яркими огнями и энергетикой.',
    architecture: 'Архитектура Таймс-сквера отражает разнообразие стилей, характерных для Нью-Йорка. Площадь окружена несколькими выдающимися зданиями, среди которых "Нью-Йорк-Таймс-билдинг" и другие небоскрёбы, выполненные в стиле ар-деко и модернизме. Здания на Таймс-сквер, как правило, имеют большие стеклянные фасады и массивные неоновые вывески, которые создают незабываемую визуальную ауру. Интересно, что самой значимой архитектурной особенностью площади является её способность к метаморфозам: на протяжении десятилетий она адаптировалась к меняющимся условиям и вкусам. Также важно отметить, что в последние годы внимание уделяется пешеходным пространствам, с установкой сидений и зелёных зон, что делает Таймс-сквер более гостеприимным для прохожих. Таким образом, архитектура Таймс-сквера является отражением динамики города, сочетая исторические элементы с современными трендами урбанистики.'
  }
]