import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as TimesSquareImg from '@assets/images/cities/New_York/attractions/Times_Square'

export const TimesSquareData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Таймс-сквер',
    address: '1560 Broadway Suite 1001. New York, NY 10036',
    link: 'https://www.timessquarenyc.org',
    image: [TimesSquareImg.Times_Square_1_Img, TimesSquareImg.Times_Square_2_Img, TimesSquareImg.Times_Square_3_Img, TimesSquareImg.Times_Square_4_Img, TimesSquareImg.Times_Square_5_Img],
    description: 'Один из самых известных и оживленных районов Нью-Йорка, который часто называют «Перекрёстком мира». Этот район известен своими яркими неоновыми вывесками, гигантскими цифровыми дисплеями и непрекращающимся потоком пешеходов и автомобилистов. Здесь находятся многочисленные театры Бродвея, магазины, рестораны и развлекательные заведения, что делает его популярным местом для туристов и местных жителей.',
    history: 'Изначально этот район назывался Лонгакр Сквер (Longacre Square) и был известен своими конюшнями, которые обслуживали конные экипажи, а также находящимися здесь небольшими заводами и мастерскими. В 1904 году издательство "The New York Times" перенесло свою штаб-квартиру на новое место, и площадь была переименована в Таймс-сквер в честь знаменитой газеты. В первых десятилетиях XX века Таймс-сквер стал важным центром развлечений и культуры. Строительство множественных театров и киностудий привлекло сюда большое количество людей. В период с 1930-х до 1960-х годов Таймс-сквер пережил серьёзные изменения. Развитие звукового кино, театральные постановки и другие развлечения сделали его ярким символом американской культуры. В 1990-х годах местные власти и частные инвесторы начали масштабную программу восстановления и реконструкции Таймс-сквер. Строительство новых зданий, увеличение числа гостиниц, магазинов и ресторанов снова сделали Таймс-сквер привлекательным местом для инвестиций и превратили его в один из самых посещаемых туристических объектов в мире.',
    view: 'Архитектура Таймс-сквер представляет собой эклектичное сочетание исторических театров и современных небоскрёбов, украшенных гигантскими электронными билбордами и неоновыми вывесками. В этом районе находятся знаменательные здания, такие как One Times Square, служащий платформой для ежегодного спуска новогоднего шара.',
    other: 'На Таймс-сквер обязательно посетите знаменитые театры на Бродвее, где проходят мировые премьеры мюзиклов и спектаклей. Полюбуйтесь на сверкающие рекламные билборды и неоновые огни. Загляните в туристический инфоцентр и купите билеты на шоу со скидкой. Обязательно сделайте фотографию у знаменитого красного лестничного подиума TKTS. Посетите магазины флагманов, такие как M&M’s World и Disney Store.'
  }
]