import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as SainteChapelleImage from '@images/cities/Paris/SainteChapelle'

export const SainteChapelleData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Сент-Шапель',
    image: [SainteChapelleImage.SainteChapelleImage, SainteChapelleImage.SainteChapelle1Image, SainteChapelleImage.SainteChapelle2Image, SainteChapelleImage.SainteChapelle3Image, SainteChapelleImage.SainteChapelle4Image],
    history: 'Сент-Шапель, или Святая капелла, была построена в XIII веке по приказу короля Людовика IX для хранения христианских реликвий, включая мощи Святого Креста. Строительство началось в 1242 году и завершилось в 1248 году. Этот период совпал с расцветом готической архитектуры во Франции. Сент-Шапель служила частью королевского дворца на Île de la Cité и была предназначена не только для богослужений, но и как храм для королевской семьи. С распространением католицизма капелла стала важным религиозным центром. В течение веков она подвергалась различным изменениям и реконструкциям, особенно в XVIII и XIX веках. В 1795 году Сент-Шапель стала национальной собственностью, а в 1846 году была воссоздана после разрушений. Сегодня она является частью Парижского суда и открыта для посетителей.',
    architecture: 'Архитектура Сент-Шапели представляет собой выдающийся пример готического стиля, с характерными высокими сводами, остроконечными арками и большим количеством витражей. Постройка имеет две уровня: нижняя капелла предназначалась для простых людей, а верхняя — для королевской семьи. Центральным элементом верхней капеллы являются её великолепные витражи, изображающие 15 сцен из Ветхого и Нового Заветов, которые занимают почти 600 квадратных метров. Высота капеллы достигает 40 метров, что создает впечатление легкости и воздушности. Белый камень, использованный в отделке, подчеркивает красоту витражей. Сент-Шапель не только служит местом поклонения, но и является шедевром средневекового искусства, привлекающим туристов со всего мира.'
  }
]