import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as JardinDuLuxembourgImage from '@images/cities/Paris/JardinDuLuxembourg'

export const JardinDuLuxembourgData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Люксембургский сад',
    image: [JardinDuLuxembourgImage.JardinDuLuxembourgImage, JardinDuLuxembourgImage.JardinDuLuxembourg1Image, JardinDuLuxembourgImage.JardinDuLuxembourg2Image, JardinDuLuxembourgImage.JardinDuLuxembourg3Image, JardinDuLuxembourgImage.JardinDuLuxembourg4Image],
    history: 'Люксембургский сад, расположенный в сердце Парижа, был основан в 1612 году по приказу королевы Марии Медичи, которая хотела создать место, напоминающее её родину, Флоренцию. Сад был первоначально частью Люксембургского дворца, построенного для королевы. В XVII веке он стал популярным местом отдыха для парижан и постепенно преобразовывался: ландшафтные дизайнеры создавали новые аллеи, фонтаны и цветники. Во время Французской революции сад был открыт для публики, что способствовало его популяризации. В XIX веке Люксембургский сад стал символом парижской жизни и культуры, несколько раз проводилась его реконструкция. В саду также разместились художественные выставки и культурные события. Сегодня он является важным пространством для отдыха, прогулок и культурных мероприятий, продолжая привлекать как местных жителей, так и туристов.',
    architecture: 'Архитектура Люксембургского сада представляет собой гармоничное сочетание французского классицизма и английского ландшафтного стиля. Центральная ось сада оформлена аллеями, ведущими к фонтану Медичи, стиль которого вдохновлён итальянскими традициями. Сад разделён на множество зон: геометрические клумбы, тенистые аллеи и зеленые площади. В центре расположен дворец, который служит домом для Сената Франции. Основной акцент сделан на симметрию и порядок, высокие деревья окружены цветниками, создающими яркие акценты. Также в саду находятся скульптуры, статуи и неоклассические здания, подчеркивающие его культурную значимость. Люксембургский сад, с его эстетичной архитектурой и живописным ландшафтом, является идеальным местом для отдыха и вдохновения.'
  }
]