import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as CharlesBridgeImg from '@assets/images/cities/Prague/attractions/Charles_Bridge'

export const CharlesBridgeData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Карлов мост',
    image: [CharlesBridgeImg.Charles_Bridge_1_Img, CharlesBridgeImg.Charles_Bridge_2_Img, CharlesBridgeImg.Charles_Bridge_3_Img, CharlesBridgeImg.Charles_Bridge_4_Img, CharlesBridgeImg.Charles_Bridge_5_Img],
    history: 'Карлов мост в Праге был заложен 9 июля 1357 года по указанию императора Карла IV как замена Староместскому мосту, который был разрушен наводнением. Строительство продолжалось около 45 лет, и мост был торжественно открыт в начале XV века. Он стал важным торговым путём, соединяющим разные части города. Архитектурный стиль моста выполнен в готическом направлении, его украшает 30 статуй святых, многие из которых были установлены в XVI-XVII веках. Мост пережил множество исторических событий, включая осады и войны, сохранив свою величественность. Сегодня Карлов мост является не только архитектурным памятником, но и популярной туристической достопримечательностью, привлекающей миллионы посетителей ежегодно.',
    architecture: 'Карлов мост, завершённый в начале XV века, представляет собой выдающийся пример готической архитектуры. Его длина достигает 516 метров, а ширина — 10 метров. Мост опирается на 16 арок, выполненных из камня, что придаёт ему прочность и устойчивость. Главные архитектурные особенности включают два великолепных готических мостовых башни: староместскую и маленькостранскую, каждая из которых оснащена защитными элементами. Мост украшен 30 статуями святых, многие из которых выполнены в барочном стиле, добавляя динамику и выразительность. Эти элементы создают уникальный визуальный эффект и подчёркивают историческую ценность сооружения. Карлов мост служит свидетельством мастерства средневековых каменщиков и архитекторов, сохраняя свое величие на протяжении веков.'
  }
]