import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as BuckinghamPalaceImage from '@images/cities/London/BuckinghamPalace'

export const BuckinghamPalaceData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Букингемский дворец',
    image: [BuckinghamPalaceImage.BuckinghamPalaceImage, BuckinghamPalaceImage.BuckinghamPalace1Image, BuckinghamPalaceImage.BuckinghamPalace2Image, BuckinghamPalaceImage.BuckinghamPalace3Image, BuckinghamPalaceImage.BuckinghamPalace4Image],
    history: 'Букингемский дворец, расположенный в центре Лондона, служит официальной резиденцией британских монархов с начала XIX века. Первоначально на этом месте находился Букингем-хаус, построенный в 1703 году для герцога Букингемского. В 1761 году дворец был приобретён королём Георгом III, который начал его трансформацию в королевскую резиденцию. В 1837 году, с восшествием на трон королевы Виктории, Букингемский дворец стал официальной резиденцией монарха. В течение XIX века дворец претерпел значительные расширения и перестройки, создавая пространство для официальных мероприятий и приёмов. В настоящее время дворец остаётся не только резиденцией королевы, но и местом проведения государственных церемоний, включая приёмы и аудиенции, а также является популярной туристической достопримечательностью.',
    architecture: 'Архитектура Букингемского дворца представляет собой великолепный пример неоклассицизма. Окончательные изменения внесли такие архитекторы, как Джон Нэш и Эдвард Блоре. Основное здание оформлено в светлых тонах, а его фасад украшен флагом и статуями, отражающими величие монархии. Дворец состоит из 775 комнат, включая государственные залы, которые великолепно оформлены и предназначены для официальных мероприятий. Одной из характерных черт архитектуры является огромная центральная лестница, ведущая к комнатам, где проходят важные церемонии. В последние десятилетия частью дворца стал также сад, занимающий около 16 гектаров, который дополняет элегантный архитектурный стиль и создает атмосферу покоя среди городского хаоса Лондона.'
  }
]