import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as GrandCentralTerminalImage from '@images/cities/NewYork/GrandCentralTerminal'

export const GrandCentralTerminalData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Центральный вокзал',
    image: [GrandCentralTerminalImage.GrandCentralTerminalImage, GrandCentralTerminalImage.GrandCentralTerminal1Image, GrandCentralTerminalImage.GrandCentralTerminal2Image, GrandCentralTerminalImage.GrandCentralTerminal3Image, GrandCentralTerminalImage.GrandCentralTerminal4Image],
    history: 'Центральный вокзал Нью-Йорка, открытый в 1913 году, стал одним из символов города и важным узлом транспортной сети США. Первоначально на этом месте находился вокзал, построенный в 1871 году, но быстро ставший недостаточным для растущего потока пассажиров. Строительство нового вокзала было инициировано компанией New York Central Railroad и заняло около 10 лет. Архитектура была разработана знаменитым архитектурным бюро Grand Central Terminal. Вокзал стал важным местом не только для железнодорожных перевозок, но и для культурной жизни города. Его огромный зал с великолепными потолками и мраморными отделками стал популярной туристической достопримечательностью. За свою историю Центральный вокзал пережил множество изменений, включая спасение от разрушения в 1960-х годах благодаря усилиям активистов, что позволило сохранить его величественный облик.',
    architecture: 'Центральный вокзал Нью-Йорка представляет собой выдающийся пример архитектуры стиля боз-ар, с его величественным фасадом и обширными интерьерами. Входит в состав Национального реестра исторических мест США. Основная лоджия поражает своей высотой, достигающей 37 метров, а ее потолок расписан звездами на фоне небесного свода. Основные материалы, использованные в отделке, включая мрамор, бронзу и медь, подчеркивают роскошь и статус здания. Лобби украшено великолепными люстрами и величественными колоннами. Также важными элементами являются знаменитые часы на главной платформе и магазинные ряды, которые добавляют атмосферу оживленного рынка. Центральный вокзал стал не только важным транспортным узлом, но и культурным центром, привлекающим посетителей своим великолепием и историей.'
  }
]