import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as SingaporeBotanicGardensImg from '@assets/images/cities/Singapore/attractions/Singapore_Botanic_Gardens'

export const SingaporeBotanicGardensData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Сингапурский ботанический сад',
    image: [SingaporeBotanicGardensImg.Singapore_Botanic_Gardens_1_Img, SingaporeBotanicGardensImg.Singapore_Botanic_Gardens_2_Img, SingaporeBotanicGardensImg.Singapore_Botanic_Gardens_3_Img, SingaporeBotanicGardensImg.Singapore_Botanic_Gardens_4_Img, SingaporeBotanicGardensImg.Singapore_Botanic_Gardens_5_Img],
    history: 'Сингапурский ботанический сад был основан в 1859 году и изначально служил местом для исследований и экспериментов в области сельского хозяйства и ботаники. Он стал важным центром по изучению тропических растений, особенно в сфере плантации каучука. На протяжении своего существования сад прошел через множество изменений и расширений. В 1950-х годах он стал популярным местом отдыха для местных жителей и туристов. В 1990-х годах началась программа по восстановлению и сохранению уникальных растительных видов, что сделало сад одной из важнейших ботанических организаций в мире. В 2015 году Сингапурский ботанический сад был включён в список объектов Всемирного наследия ЮНЕСКО, что подчеркивает его культурное и историческое значение.',
    architecture: 'Архитектура Сингапурского ботанического сада гармонично сочетается с природным окружением. Пространства расположены на разных  уровнях, создавая живописные виды и уютные уголки для отдыха. Одним из главных архитектурных объектов является Национальный орхидеевый сад, который, помимо обширной коллекции орхидей, включает в себя оригинальные павильоны, чаши и водоемы, отражающие тропическую флору. Прогулочные дорожки и мосты плавно интегрированы в ландшафт, а стильные беседки обеспечивают комфортный отдых. Использование экологичных материалов и минималистского дизайна акцентирует внимание на красоте природы, делая ботанический сад идеальным местом для образовательных мероприятий и культурных событий.'
  }
]