import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as PlaceDesVosgesImage from '@images/cities/Paris/PlaceDesVosges'

export const PlaceDesVosgesData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Площадь Вогезов',
    image: [PlaceDesVosgesImage.PlaceDesVosgesImage, PlaceDesVosgesImage.PlaceDesVosges1Image, PlaceDesVosgesImage.PlaceDesVosges2Image, PlaceDesVosgesImage.PlaceDesVosges3Image, PlaceDesVosgesImage.PlaceDesVosges4Image],
    history: 'Площадь Вогезов, расположенная в сердце исторического района Маре в Париже, была заложена в начале XVII века по приказу короля Людовика XIII. Построенная между 1605 и 1612 годами, она стала первой специализированной площадью в городе и символом нового стиля городской планировки. Проектировал её архитектор, вдохновленный идеями ренессанса. Первоначально площадь носила имя "Площадь Королевы" в честь королевы Анны Австрийской, но с течением времени была переименована в честь взятия Вогезов во время Тридцатилетней войны. Архитектурный ансамбль площади включает 36 одинаковых домов с красными кирпичами и белыми известняковыми карнизами, что создаёт единый гармоничный вид. С момента своего создания площадь привлекала многочисленные художников и писателей, став важным культурным центром.',
    architecture: 'Архитектура Площади Вогезов является образцом классического стиля XVII века. Площадь представляет собой квадрат размером 140 метров на 140 метров, окружённый симметричными домами с однотипными фасадами. Все здания выполнены из красного кирпича с белыми каменными отделками, что создаёт зрительный эффект единства и гармонии. Мансардные крыши, декорированные черепицей, и арки, расположенные на первых этажах, добавляют шарма. Особенностью площади являются также оригинальные кованые балконы, придающие домам элегантность. Центральная часть площади украшена парком с фонтаном, который служит местом отдыха для местных жителей и туристов. Стиль барокко в архитектуре площади отражает усилия королевской власти закрепить монаршую мощь и создать образец идеального городского пространства. Сегодня площадь остаётся важной частью парижского культурного наследия, привлекая множество посетителей своей красотой и историей.'
  }
]