import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as PragueCastleImage from '@images/cities/Prague/PragueCastle'

export const PragueCastleData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Пражский Град',
    image: [PragueCastleImage.PragueCastleImage, PragueCastleImage.PragueCastle1Image, PragueCastleImage.PragueCastle2Image, PragueCastleImage.PragueCastle3Image, PragueCastleImage.PragueCastle4Image],
    history: 'Пражский Град, основанный в IX веке, является одной из старейших и самых значительных резиденций в Европе. Первоначально как крепость, он стал политическим и культурным центром Чехии. В XII-XIII веках здесь была построена собор святого Вита, который стал символом чешского государства. В XIV веке Град приобрёл особое значение при правлении Карла IV, который сделал его королевской резиденцией. С тех пор Град пережил множество исторических событий, включая гуситские войны, Тридцатилетнюю войну и период коммунистического правления. С переходом к демократии в 1989 году Пражский Град снова стал официальной резиденцией президента Чехии, сохраняя свой статус исторического и культурного символа страны.',
    architecture: 'Архитектура Пражского Града представляет собой уникальное сочетание стилей, включая романский, готический, ренессансный и барочный. Основным элементом комплекса является собор святого Вита, который является шедевром готической архитектуры с великолепными витражами и величественными башнями. Рядом расположены Королевский дворец, построенный в стиле ренессанса, и базилика святого Георгия, сохранившая свои романские элементы. Аркады, дворики и сады создают гармоничную атмосферу для прогулок. Пражский Град не только архитектурная жемчужина, но и исторический памятник, отражающий эволюцию чешского государства и его культурное наследие. Его величественные здания и живописные виды на город делают Град одной из самых посещаемых достопримечательностей Праги.'
  }
]