import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as TowerOfLondonImage from '@images/cities/London/TowerOfLondon'

export const TowerOfLondonData: AboutAttractionProps[] = [
    
  { 
    id: 1,
    title: 'Лондонский Тауэр',
    image: [TowerOfLondonImage.TowerOfLondonImage, TowerOfLondonImage.TowerOfLondon1Image, TowerOfLondonImage.TowerOfLondon2Image, TowerOfLondonImage.TowerOfLondon3Image, TowerOfLondonImage.TowerOfLondon4Image],
    history: 'Лондонский Тауэр, основанный в конце 11 века Вильгельмом Завоевателем, изначально строился как королевкая резиденция и символ власти. С течением времени он превратился в королевскую тюрьму, где содержались наиболее опасные преступники. Среди знаменитых заключенных были Анна Болейн и Томас Мора. Тауэр стал местом многих казней и политических интриг. В XVI веке здесь появились королевские охотничьи соколы, и он стал центром искусства соколиной охоты. В 1666 году, после Великой лондонской пожара, укрепления Тауэра были восстановлены. Сегодня Тауэр является объектом Всемирного наследия ЮНЕСКО и одной из главных туристических достопримечательностей Лондона, сохраняя в себе дух истории и многообразие событий, связанных с британской монархией.',
    architecture: 'Архитектурный стиль Лондонского Тауэра представляет собой смешение нормандского и готического стилей. Главной частью комплекса является Белая башня, построенная из известняка и служившая королевской резиденцией. Эта башня имеет квадратную форму и три этажа, украшенные узкими окнами и мощными стенами. Вокруг Белой башни расположены другие постройки, такие как Кражевая башня и Башня Люцифера, а также мощные крепостные стены, делающие Тауэр неприступным. Тауэр окружен рвом и имеет несколько ворот, включая Гиддосгейт. Архитектура Тауэра также включает элементы позднего средневековья, такие как большие ступени и готические элементы. Для защиты и эстетики в архитектуре использовались различные декоративные элементы, такие как гербы и барельефы. В целом, Лондонский Тауэр является выдающимся примером военной и гражданской архитектуры своего времени.'
  }
]