import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as MetropolitanMuseumOfArtImage from '@images/cities/NewYork/MetropolitanMuseumOfArt'

export const MetropolitanMuseumOfArtData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Метрополитен-музей',
    image: [MetropolitanMuseumOfArtImage.MetropolitanMuseumOfArtImage, MetropolitanMuseumOfArtImage.MetropolitanMuseumOfArt1Image, MetropolitanMuseumOfArtImage.MetropolitanMuseumOfArt2Image, MetropolitanMuseumOfArtImage.MetropolitanMuseumOfArt3Image, MetropolitanMuseumOfArtImage.MetropolitanMuseumOfArt4Image],
    history: 'Метрополитен-музей, основанный в 1870 году, стал одним из ведущих художественных музеев мира. Идея создания музея возникла от группы американских художников и меценатов, стремившихся сделать искусство более доступным для широкой публики. Официальное открытие состоялось в 1880 году в здании на 3-й авеню. В 1902 году музей переехал в новое, более просторное здание на 82-й улице и 5-й авеню, дизайн которого разработали американские архитекторы Калверт Вокс и Джейкоб Моулд. Со временем музей значительно расширялся и пополнялся новыми коллекциями, включая произведения европейских мастеров, древности, исламское искусство, американские картины и многие другие направления. Сегодня Метрополитен-музей насчитывает более двух миллионов экспонатов и привлекает миллионы посетителей ежегодно, становясь важным культурным центром Нью-Йорка.',
    architecture: 'Архитектура Метрополитен-музея сочетает элементы классического и современного стилей. Главное здание, выполнено в неоклассическом стиле и открыто в 1902 году. Его драматический фасад украшен колоннами и великолепными лестницами, что придаёт ему величественный вид. В течение XX века музей подвергался множественным расширениям и реконструкциям. Одним из самых известных — это крытое стеклянное пространство, открывшееся в 2004 году, спроектированное архитектором Ричардом Мейером. Это современное дополнение создаёт контраст с историческим фасадом, внося новые элементы света и пространства. Архитектурный комплекс музея отражает эволюцию стилей и технологий, что делает его не только хранилищем искусства, но и интересным объектом для изучения самой архитектуры.'
  }
]