import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as BritishMuseumImg from '@assets/images/cities/London/attractions/British_Museum'

export const BritishMuseumData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'British Museum',
    address: 'Great Russell Street London WC1B 3DG',
    link: 'https://www.britishmuseum.org',
    image: [BritishMuseumImg.British_Museum_1_Img, BritishMuseumImg.British_Museum_2_Img, BritishMuseumImg.British_Museum_3_Img, BritishMuseumImg.British_Museum_4_Img, BritishMuseumImg.British_Museum_5_Img],
    description: 'Один из крупнейших и наиболее значимых музеев мира, расположенный в Лондоне. Основанный в 1753 году, музей обладает одной из самых богатых и разнообразных коллекций артефактов, представляющих культуру и историю человеческой цивилизации от древнейших времен до современности. Его коллекция насчитывает более 8 миллионов предметов, и многие из них считаются истинными сокровищами мировой культуры.',
    history: 'Британский музей был основан на базе коллекции сэра Ганса Слоана, врача и натуралиста, который завещал свою огромную коллекцию нации. Первая версия музея открылась для публики 15 января 1759 года в особняке Монтегю-хаус. Впоследствии, из-за стремительного роста коллекции, здание музея несколько раз перестраивалось, и нынешнее здание, спроектированное архитектором сэром Робертом Смарти, было завершено в середине 19 века.',
    view: 'Архитектурный ансамбль музея представляет собой образец неоклассической архитектуры. Особенно выделяются монументальный фасад с колоннами и купол Большого двора, также известного как Двор имени Королевы Елизаветы II, который был открыт в 2000 году. Этот впечатляющий крытый атриум, спроектированный архитекторами Норманом Фостером и партнерством «Foster and Partners», является крупнейшим крытым общественным пространством в Европе.',
    other: 'Экспонаты Британского музея охватывают несколько тысячелетий и представляют культуры всех континентов: Египетская коллекция - вторая по величине после Египетского музея в Каире. Здесь можно увидеть знаменитый Розеттский камень, статуи фараонов и мумии. Древнегреческая и Римская коллекция - включает в себя скульптуры Парфенона, известные как мраморы Элгина, и тысячи других артефактов. Ближневосточная коллекция - содержит элементы из древнего Месопотамии, включая знаменитую библиотеку Ашшурбанипала и ассирийские рельефы. Азиатская секция - охватывает искусство и артефакты из Китая, Индии, Японии и других стран Азии, включая буддийские статуи и керамику. Африканская и океанийская коллекция - предметы, которые иллюстрируют богатую культуру и традиции народов Африки и Океании. Медальоны, монеты и памфлеты - одна из крупнейших коллекций нумизматики в мире.'
  }
]