import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as BuckinghamPalaceImg from '@assets/images/cities/London/attractions/Buckingham_Palace'

export const BuckinghamPalaceData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Букингемский дворец',
    address: 'Buckingham Palace, London SW1A 1AA',
    link: 'https://www.rct.uk/visit/buckingham-palace',
    image: [BuckinghamPalaceImg.Buckingham_Palace_1_Img, BuckinghamPalaceImg.Buckingham_Palace_2_Img, BuckinghamPalaceImg.Buckingham_Palace_3_Img, BuckinghamPalaceImg.Buckingham_Palace_4_Img, BuckinghamPalaceImg.Buckingham_Palace_5_Img],
    description: 'Это величественная резиденция британской монархии в Лондоне, олицетворяющая историю и традиции Великобритании. Расположенный в Вестминстере, этот великолепный дворец является официальным домом короля или королевы и используется для важных государственных мероприятий, торжественных приемов и иных официальных церемоний.',
    history: 'История дворца начинается в 1703 году, когда его построили для герцога Букингема. В 1761 году король Георг III приобрел это здание для своей супруги, королевы Шарлотты, и с тех пор оно стало королевской резиденцией. В течение 19-го века дворец значительно расширяли и перестраивали, чтобы придать ему современный облик, включая знаменитый фасад, спроектированный Эштоном Уэббом в 1913 году.',
    view: 'Букингемский дворец известен своим впечатляющим внешним видом, великолепными внутренними интерьерами и обширными, прекрасно ухоженными садами. Внутри дворца можно найти изысканные залы, такие как Тронный зал, Балконный зал и Зал аудиенций, которые украшены произведениями искусства, роскошной мебелью и антиквариатом. В Государственных апартаментах, которые открыты для посетителей в летние месяцы, демонстрируются роскошные реликвии королевской семьи.',
    other: 'Букингемский дворец также славится своими садами, раскинувшимися на территории в 39 акров. В садах находятся живописные озера, ухоженные лужайки и цветущие клумбы, что делает их прекрасным местом для прогулок и спокойного отдыха.'
  }
]