import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as LondonEyeImg from '@assets/images/cities/London/attractions/London_Eye'

export const LondonEyeData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'London Eye',
    address: 'Riverside Building, County Hall, London SE1 7PB',
    link: 'https://www.londoneye.com',
    image: [LondonEyeImg.London_Eye_1_Img, LondonEyeImg.London_Eye_2_Img, LondonEyeImg.London_Eye_3_Img, LondonEyeImg.London_Eye_4_Img, LondonEyeImg.London_Eye_5_Img],
    description: 'Одно из самых популярных туристических мест в Лондоне. Известное также как Миллениум-Колесо, представляет собой огромное наблюдательное колесо высотой около 135 метров. Пассажиры могут сесть в капсулу и наслаждаться панорамным видом на всю Лондонскую столицу. Оборудование колеса обеспечивает плавное вращение капсул, позволяя каждому пассажиру наслаждаться прекрасными видами на город.',
    history: 'История Лондонского глаза насчитывает более двадцати лет. Оно было открыто для посетителей 9 марта 2000 года ко дню Матери в Лондоне. London Eye, изначально известное как Millennium Wheel, было создано в честь наступления нового тысячелетия. Колесо обозрения было спроектировано и построено компанией British Airways, а затем передано в собственность Merlin Entertainments. Это стало одной из главных достопримечательностей Лондона, привлекающей миллионы туристов каждый год.',
    view: 'Само колесо выполнено в современном стиле и имеет эстетичный внешний вид, подчеркивающий его значимость как символ Лондона. Внутренние интерьеры капсул оформлены стильно и комфортно. Округлые капсулы оборудованы стеклянными стенами, что обеспечивает пассажирам великолепный обзор пейзажей Лондона. Внутри установлены сиденья и платформы, чтобы посетители могли свободно перемещаться и наслаждаться видом с разных точек.',
    other: 'Пассажиры в кабинах могут увидеть такие знаковые достопримечательности, как Биг Бен, Букингемский дворец, Тауэр и Лондонский мост. От высоты колеса обозрения также отлично видно реку Темзу, городские парки, архитектурные шедевры и современные здания Лондона. Поездка на London Eye предлагает уникальную перспективу на город и является одним из лучших способов насладиться панорамой Лондона.'
  }
]