import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as NationalGalleryImg from '@assets/images/cities/London/attractions/National_Gallery'

export const NationalGalleryData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Национальная галерея',
    image: [NationalGalleryImg.National_Gallery_1_Img, NationalGalleryImg.National_Gallery_2_Img, NationalGalleryImg.National_Gallery_3_Img, NationalGalleryImg.National_Gallery_4_Img, NationalGalleryImg.National_Gallery_5_Img],
    history: 'Галерея была основана в 1824 году в Лондоне как государственное институт, предназначенный для общественного использования и представления шедевров живописи. Открытие галереи состоялось в 1824 году, а в 1838 году она была открыта для посетителей в новом здании на Трафальгарской площади. Музей был создан с целью сохранения и распространения произведений искусства и способствовал развитию художественного образования общества. С тех пор National Gallery стала одним из крупнейших и современных музеев мира, демонстрирующим шедевры живописи различных эпох и направлений искусства.',
    architecture: 'Архитектура галереи является примером классического здания, отличающегося своим элегантным и величественным стилем. Здание музея было спроектировано архитектором Уильямом Уилкинсом. Основные черты архитектуры National Gallery включают в себя классическую фасаду с колоннами и портиком, который придает зданию величественный вид. Внутри здания преобладают высокие потолки, обширные галереи и изысканные детали отделки, создающие благородную обстановку для хранения и презентации коллекции произведений искусства.'
  }
]