import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as PalaceOfWestminsterImg from '@assets/images/cities/London/attractions/Palace_of_Westminster'

export const PalaceOfWestminsterData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Вестминстерский дворец',
    image: [PalaceOfWestminsterImg.Palace_of_Westminster_1_Img, PalaceOfWestminsterImg.Palace_of_Westminster_2_Img, PalaceOfWestminsterImg.Palace_of_Westminster_3_Img, PalaceOfWestminsterImg.Palace_of_Westminster_4_Img, PalaceOfWestminsterImg.Palace_of_Westminster_5_Img],
    history: 'История Вестминстерского дворца насчитывает более тысячи лет. Изначально на этом месте находилось королевское жилье, которое использовалось с XI века, когда Эдуард Исповедник построил здесь свой дворец. В 1265 году здания начали использоваться для заседаний Парламента. В 1834 году большая часть старого дворца была разрушена в результате сильного пожара. Сразу после пожара, в 1840 году, началось строительство нового здания по проекту архитектора Чарльза Бэрри, которому помогал Август Пьюджин, специалист по готической архитектуре. Строительство завершилось в 1870 году, и новый дворец стал выдающимся образом неоготической архитектуры.',
    architecture: 'Архитектурный стиль Вестминстерского дворца представляет собой яркий пример неоготики. Здание возвышается величественностями своими башнями и фасадами, украшенными элементами готической архитектуры. Башня Виктории (Victoria Tower) – это самая высокая башня дворца, которая достигает 98,5 метров и служит официальным входом в Парламент. Башня Биг-Бен (Elizabeth Tower) – одна из наиболее узнаваемых архитектурных достопримечательностей в мире. Название "Биг-Бен" в народе присвоено главным часам и их колоколу. Зал Святого Стефана – просторный и торжественный зал, в котором проводятся церемонии и важные государственные мероприятия. Со своими 1100 комнатами, 100 лестницами и 3,2 километрами коридоров Вестминстерский дворец представляет собой сложный и многоуровневый архитектурный ансамбль.'
  }
]