import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as PalaceOfWestminsterImg from '@assets/images/cities/London/attractions/Palace_of_Westminster'

export const PalaceOfWestminsterData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Palace of Westminster',
    address: 'Parliament Square, Westminster, London, SW1A 0AA',
    link: 'https://www.parliament.uk',
    image: [PalaceOfWestminsterImg.Palace_of_Westminster_1_Img, PalaceOfWestminsterImg.Palace_of_Westminster_2_Img, PalaceOfWestminsterImg.Palace_of_Westminster_3_Img, PalaceOfWestminsterImg.Palace_of_Westminster_4_Img, PalaceOfWestminsterImg.Palace_of_Westminster_5_Img],
    description: 'Вестминстерский дворец, также известный как Дом Парламента, является одним из самых знаменитых архитектурных и исторических памятников Великобритании. Расположенный на берегу реки Темзы в центре Лондона, он служит местом заседаний двух палат Парламента Великобритании: Палаты общин и Палаты лордов.',
    history: 'История Вестминстерского дворца насчитывает более тысячи лет. Изначально на этом месте находилось королевское жилье, которое использовалось с XI века, когда Эдуард Исповедник построил здесь свой дворец. В 1265 году здания начали использоваться для заседаний Парламента. В 1834 году большая часть старого дворца была разрушена в результате сильного пожара. Сразу после пожара, в 1840 году, началось строительство нового здания по проекту архитектора Чарльза Бэрри, которому помогал Август Пьюджин, специалист по готической архитектуре. Строительство завершилось в 1870 году, и новый дворец стал выдающимся образом неоготической архитектуры.',
    view: 'Архитектурный стиль Вестминстерского дворца представляет собой яркий пример неоготики. Здание возвышается величественностями своими башнями и фасадами, украшенными элементами готической архитектуры. Башня Виктории (Victoria Tower) – это самая высокая башня дворца, которая достигает 98,5 метров и служит официальным входом в Парламент. Башня Биг-Бен (Elizabeth Tower) – одна из наиболее узнаваемых архитектурных достопримечательностей в мире. Название "Биг-Бен" в народе присвоено главным часам и их колоколу. Зал Святого Стефана – просторный и торжественный зал, в котором проводятся церемонии и важные государственные мероприятия. Со своими 1100 комнатами, 100 лестницами и 3,2 километрами коридоров Вестминстерский дворец представляет собой сложный и многоуровневый архитектурный ансамбль.',
    other: 'Вестминстерский дворец является сердцем британской демократии, местом, где принимаются важнейшие решения, влияющие на жизнь страны и мира. Здесь проходили и продолжают проходить исторические события и важные государственные мероприятия, такие как открытие сессий парламента королевой. Кроме своей политической функции, Вестминстерский дворец привлекает тысячи туристов ежегодно, благодаря своим историческим и архитектурным достоинствам. Здание входит в список объектов Всемирного наследия ЮНЕСКО с 1987 года, что подчеркивает его культурную и историческую значимость не только для Великобритании, но и для всего мира.'
  }
]