import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as TheShardImg from '@assets/images/cities/London/attractions/The_Shard'

export const TheShardData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Шард',
    image: [TheShardImg.The_Shard_1_Img, TheShardImg.The_Shard_2_Img, TheShardImg.The_Shard_3_Img, TheShardImg.The_Shard_4_Img, TheShardImg.The_Shard_5_Img],
    history: 'Осколок стекла, или Шард, был завершён в 2012 году и стал новым символом Лондона. Проект был разработан архитектором Ренцо Пиано, который выиграл конкурс на его строительство в 2000 году. Строительство началось в 2009 году на месте комплекса «Юнион» и занимало пять лет. Шард стал самым высоким зданием в Великобритании и третьим по высоте в Европе, достигнув 310 метров. В его конструкции использованы современные технологии и экологические решения, такие как система управления температурой и энергосбережения. Открытие Шарда совпало с Олимпийскими играми в Лондоне, что сделало его ещё более знаковым объектом для города.',
    architecture: 'Архитектура Шарда выделяется своей уникальной формой и использованием стеклянных материалов. Здание имеет пирамидальную форму, напоминающую осколок, что отражает название. Фасад покрыт 11 000 стеклянными панелями, создающими эффект прозрачности и легкости. Интерьеры Шарда также потрясают современными решениями: они открыты и светлы, с панорамными окнами, предлагающими великолепные виды на Лондон. Внутри располагаются офисы, рестораны, отели и смотровая площадка на высоте 244 метров, что делает его одной из главных туристических достопримечательностей столицы. Дизайн Шарда гармонично вписывается в городской ландшафт, став символом нового Лондона, более современного и ориентированного на будущее.'
  }
]