import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as TowerOfLondonImg from '@assets/images/cities/London/attractions/Tower_of_London'

export const TowerOfLondonData: AboutAttractionProps[] = [
    
  { 
    id: 1,
    title: 'Лондонский Тауэр',
    image: [TowerOfLondonImg.Tower_of_London_1_Img, TowerOfLondonImg.Tower_of_London_2_Img, TowerOfLondonImg.Tower_of_London_3_Img, TowerOfLondonImg.Tower_of_London_4_Img, TowerOfLondonImg.Tower_of_London_5_Img],
    history: 'История Лондонского Тауэра начинается в XI веке. Основанный Вильгельмом Завоевателем в 1066 году после его победы в битве при Гастингсе, Тауэр был построен для защиты Лондона и утверждения его власти. Центральная часть комплекса, Белый Тауэр (White Tower), была завершена в 1078 году и служила королевской резиденцией, а также крепостью. На протяжении веков Лондонский Тауэр расширялся, превращаясь в мощный крепостной комплекс, включающий внутренний и внешний дворы, мощные стены и многочисленные башни. Эти дополнительные сооружения были построены в основном в XII и XIII веках.',
    architecture: 'Лондонский Тауэр представляет собой сложный ансамбль зданий и укреплений. Наиболее значимыми элементами комплекса являются: Белый Тауэр (White Tower) – массивное каменное строение, которое являлось ядром оригинального замка. Его высота составляет около 27 метров. В его залах расположен Аморий (Armoury), где хранятся коллекции оружия и доспехов. Кровавая башня (Bloody Tower) – известна как предполагаемое место убийства двух принцев, Эдуарда V и его брата Ричарда, в XV веке. Внутри башни представлена экспозиция, посвященная этим событиям. Башня Уордера (Beauchamp Tower) – знаменита своими камерами для пленников, стены которых покрыты многочисленными надписями и граффити, оставленными узниками. Башня Королевы Елизаветы (Queen’s House) – деревянная постройка, выполненная в стиле Тюдоров, используемая для размещения высокопоставленных заключенных.'
  }
]