import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as BritishMuseumImage from '@images/cities/London/BritishMuseum'

export const BritishMuseumData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Британский музей',
    image: [BritishMuseumImage.BritishMuseumImage, BritishMuseumImage.BritishMuseum1Image, BritishMuseumImage.BritishMuseum2Image, BritishMuseumImage.BritishMuseum3Image, BritishMuseumImage.BritishMuseum4Image],
    history: 'Британский музей, основанный в 1753 году, стал первым национальным музеем Великобритании. Его создавали на основе коллекции доктора Ганса Слоуна, известного натуралиста и коллекционера. Первоначально музей располагался в доме Латимер-Хаус, а затем в специально построенном здании в Блумсбери. В 1823 году музей открылся для широкой публики, что сделало его доступным для всех желающих. Британский музей стал домом для многочисленных артефактов со всего мира, благодаря колониальным экспедициям и приобретениям. В результате были собраны уникальные коллекции из Египта, Греции, Рима и Месопотамии. Музей продолжал расширяться в XIX и XX веках, увеличивая свои фонды и вливаясь в академическую и культурную жизнь страны. Сегодня он охватывает более 2 миллионов предметов, представляющих человеческую историю и культуру на протяжении более 2 миллионов лет.',
    architecture: 'Архитектура Британского музея — это яркий пример классицизма. Первоначальное здание спроектировано Робертом Смёрке и было завершено в 1852 году. Его фасад украшает впечатляющая колоннада, состоящая из 44 коринфских колонн, что придаёт зданию величественный вид. Одной из самых знаковых особенностей музея является его круглый двор, известный как "Световой двор", который был открыт в 2000 году. Этот современный элемент, спроектированный архитектором Норманом Фостером, гармонично сочетается с историческими частями здания. Стеклянная крыша в форме сети символизирует свет и прозрачность, создавая пространство, где посетители могут взаимодействовать с культурой и историей. Внутри музея также расположены разнообразные выставочные залы и библиотечные пространства, что делает архитектуру музея не только красивой, но и функциональной.'
  }
]