import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as BrooklynBridgeImage from '@images/cities/NewYork/BrooklynBridge'

export const BrooklynBridgeData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Бруклинский мост',
    image: [BrooklynBridgeImage.BrooklynBridgeImage, BrooklynBridgeImage.BrooklynBridge1Image, BrooklynBridgeImage.BrooklynBridge2Image, BrooklynBridgeImage.BrooklynBridge3Image, BrooklynBridgeImage.BrooklynBridge4Image],
    history: 'Бруклинский мост, соединяющий Бруклин и Манхэттен в Нью-Йорке, был построен в 1869-1883 годах и стал одним из первых висячих мостов, использующих стальные провода. Основным архитектором и инициатором проекта был - Джон Рёблинг. Строительство моста сопровождалось множеством трудностей, включая финансовые затруднения и разрушительные ураганы. К сожалению, Джон Рёблинг погиб во время строительства, и его жена, Эмили, стала первой женщиной, которая прошла по мосту, отметив его открытие в 1883 году. На момент открытия Бруклинский мост стал самым длинным висячим мостом в мире, с общей длиной 1,834 метров. Этот объект стал символом Нью-Йорка и новаторством инженерной мысли, а также выразил оптимизм и амбиции эпохи индустриализации. Мост значительно упростил транспортные связи между двумя районами, что способствовало экономическому росту и развитию города.',
    architecture: 'Архитектура Бруклинского моста уникальна и впечатляюща. Он сочетает в себе элементы неоготики и инженерного гения своего времени. Два массивных пилона высотой 84 метра, выполненные из гранита, придают мосту монументальный вид и служат не только эстетическим, но и функциональным элементом. Пилоны оформлены витковыми арками и сложными декоративными деталями, что создает ощущение величия. Мост поддерживается 27 стальными канатами, которые стали стандартом для многих современных висячих мостов. Его конструкция оптимизирована для равномерного распределения нагрузки, что является результатом тщательных инженерных расчетов. Кроме того, Бруклинский мост был первым мостом, который использовал стальные тросы, что обеспечивало большую прочность и долговечность. Дорожные полотна для пешеходов и автомобилей располагаются на разных уровнях, что делает переход удобным. С момента открытия мост стал не только транспортной артерией, но и культурным символом, олицетворяющим дух Нью-Йорка.'
  }
]