import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as TowerBridgeImage from '@images/cities/London/TowerBridge'

export const TowerBridgeData: AboutAttractionProps[] = [

  {
    id: 1,
    title: 'Тауэрский мост',
    image: [TowerBridgeImage.TowerBridgeImage, TowerBridgeImage.TowerBridge1Image, TowerBridgeImage.TowerBridge2Image, TowerBridgeImage.TowerBridge3Image, TowerBridgeImage.TowerBridge4Image,],
    history: 'Тауэрский мост, один из самых знаковых символов Лондона, был открыт 30 июня 1894 года после семи лет строительства. Идея создания моста возникла в конце XIX века, когда быстро растущее население города требовало новых путей пересечения реки Темзы, не нарушая работу портов. Архитектор Хорас Джонс был назначен руководить проектом, чтобы создать функциональный и декоративный мост. Строительство моста столкнулось с рядом вызовов, включая инженерные сложности и протесты местных жителей. Однако дизайн моста, стилизованный под неоготический стиль, гармонично вписался в архитектурный пейзаж, рядом с Тауэром Лондона. После завершения, Тауэрский мост стал важной транспортной артерией и привлек большим количеством туристов. Сегодня он остается одной из главных достопримечательностей Лондона, впечатляя своим историческим значением и архитектурной красотой.',
    architecture: 'Архитектура Тауэрского моста сочетает в себе элементы викторианского неоготического стиля и инновационные инженерные решения. Мост представляет собой подвесную конструкцию с двумя массивными башнями высотой около 65 метров, выполненными из красного кирпича и камня, которые придают ему величественный облик. Каждая башня соединена горизонтальными пешеходными галереями, обеспечивающими доступ между ними и позволяющими любоваться видами на реку Темзу. Механизм подъема моста, основанный на паровых машинах, позволяет судам проходить под ним. Внешние элементы оформлены декоративными арками и шпилями, создающими впечатляющий силуэт на фоне лондонского пейзажа. Внутри мост оборудован современными выставочными залами, которые рассказывают о его истории и инженерных особенностях. Тауэрский мост стал не только важным транспортным объектом, но и архитектурным символом Лондона, привлекающим миллионы туристов своей красотой и исторической значимостью.'
  }
]