import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as EiffelTowerImage from '@images/cities/Paris/EiffelTower'

export const EiffelTowerData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Эйфелева башня',
    image: [EiffelTowerImage.EiffelTowerImage, EiffelTowerImage.EiffelTower1Image, EiffelTowerImage.EiffelTower2Image, EiffelTowerImage.EiffelTower3Image, EiffelTowerImage.EiffelTower4Image],
    history: 'Эйфелева башня, символ Парижа и Франции, была построена для Всемирной выставки 1889 года, посвященной столетию Французской революции. Проект разработал инженер Гюстав Эйфель, который вместе с командой специалистов использовал новейшие технологии своего времени. Строительство началось в январе 1887 года и завершилось в марте 1889 года. Башня, высотой 300 метров, первоначально вызывала споры и протесты среди парижан и художников. Однако, по мере роста популярности, она стала одним из наиболее узнаваемых зданий мира. С момента своего открытия башня была внесена в перечень памятников и претерпела несколько перестроек, включая установку лифта. В 1909 году ее собирались демонтировать, но благодаря радиосвязи она была сохранена. Сегодня Эйфелева башня принимает около 7 миллионов посетителей в год и не теряет своего величия.',
    architecture: 'Башня, выполненная из чугунного сплава, удивляет своей легкостью и изяществом. Архитектурное решение основано на принципах аэродинамики и несущей способности. Башня состоит из четырех массивных оснований, которые постепенно сужаются к вершине, формируя стальную решетку, что придает ей не только прочность, но и элегантность. Высота первоначальной конструкции составляла 300 метров, а со времени добавления антенны в 1957 году – 330 метров. Внешний вид башни меняется с каждым этапом окраски, что помогает защитить ее от коррозии. Она окрашена в оттенки коричневого, известные как "Эйфелева коричневая", чтобы гармонировать с окружающим пейзажем. На вершине расположена смотровая площадка, откуда открываются захватывающие виды на Париж, что делает башню популярным туристическим объектом.'
  }
]