import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as HarrodsImage from '@images/cities/London/Harrods'

export const HarrodsData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Харродс',
    image: [HarrodsImage.HarrodsImage, HarrodsImage.Harrods1Image, HarrodsImage.Harrods2Image, HarrodsImage.Harrods3Image, HarrodsImage.Harrods4Image],
    history: 'Харродс, один из самых известных и роскошных универмагов в мире, был основан в 1824 году Чарльзом Генри Хэрродом как небольшой магазин продуктов питания в районе Бромптон. Со временем бизнес расширился, и в 1851 году он стал полноценным универмагом. После пожара в 1883 году магазин был полностью восстановлен и перестроен в роскошном викторианском стиле. В 1894 году Харродс открыл свои двери для публики в новом здании, созданном в характерной для эпохи архитектуре. В начале XX века магазин стал известен благодаря своим элитным товарам и первоклассному обслуживанию. За годы своего существования Харродс пережил множество изменений и адаптаций к требованиям времени, но сохранил свою уникальную атмосферу и репутацию. В 1985 году Харродс был приобретен египетским миллиардером Мохаммедом аль-Файедом, что дало новый импульс его развитию. Сегодня он по-прежнему привлекает клиентов со всего мира благодаря своим роскошным товарам, уникальному дизайну и богатой истории.',
    architecture: 'Архитектура универмага Харродс поражает своим великолепием и масштабами. Главное здание, расположенное на уже известной улице Бромптон-Роуд, построено в викторианском стиле с элементами неороманского и неоготического направлений. Фасад здания выполнен из характерного для Лондона песчаника и представлен в стиле, который подчеркивает его статус как одного из самых роскошных магазинов в мире. Особенностью архитектуры Харродс являются 330 тысяч керамических плиток на фасаде, а также более 30 осветительных куполов, которые наполняют внутренние пространства естественным светом. Интерьеры универмага имеют роскошные мраморные лестницы, витражи и золотые отделки. Архитектор, создавший интерьер, приложил немало усилий, чтобы сделать каждую деталь уникальной. Современные дополнения, такие как более 300 отделов, ресторанов и даже продовольственный рынок, органично вписываются в обилие исторического наследия, что делает Харродс не только магазином, но и настоящей достопримечательностью Лондона'
  }
]