import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as VanGoghMuseumImage from '@images/cities/Amsterdam/VanGoghMuseum'

export const VanGoghMuseumData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Музей Ван Гога',
    image: [VanGoghMuseumImage.VanGoghMuseumImage, VanGoghMuseumImage.VanGoghMuseum1Image, VanGoghMuseumImage.VanGoghMuseum2Image, VanGoghMuseumImage.VanGoghMuseum3Image, VanGoghMuseumImage.VanGoghMuseum4Image],
    history: 'Музей Ван Гога в Амстердаме был открыт в 1973 году и стал домом для самой большой коллекции работ художника, которую когда-либо собирали. Идея создания музея принадлежит брату Ван Гога, Тео, и его семье, которые на протяжении многих лет собирали картины и письма художника. В начале 20 века были основаны различные инициативы, направленные на сохранение наследия Ван Гога, что в конечном итоге привело к созданию музея. Первоначально в здании находился небольшой выставочный зал, но с течением времени он был расширен с помощью архитекторов, которые добавили новые пространства для экспозиций. Сегодня музей привлекает миллионы туристов ежегодно и играет важную роль в изучении и популяризации творчества Ван Гога, а также в сохранении его наследия.',
    architecture: 'Архитектура музея — это гармоничное сочетание современного дизайна и функциональности. Первоначальное здание, было построено в стиле, который отражал элементы традиционной нидерландской архитектуры. Оно отличается простыми, но элегантными формами, а также обилием естественного света, что создает комфортную атмосферу для восприятия искусства. В 1999 году было добавлено новое крылом. Это современное расширение выполнено в минималистском стиле с большими стеклянными фасадами, что позволяет посетителям наслаждаться видами на окружающий сад и на сам музей. Архитектурные решения здания акцентируют внимание на выставках, позволяя создавать различные маршруты для посетителей и максимально эффективно представлять коллекцию работ Ван Гога. Вместе старое и новое представляют уникальную архитектурную гармонию на фоне культурного ландшафта Амстердама.'
  }
]