import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as StBasilsCathedralImage from '@images/cities/Moscow/StBasilsCathedral'

export const StBasilsCathedralData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Храм Василия Блаженного',
    image: [StBasilsCathedralImage.StBasilsCathedralImage, StBasilsCathedralImage.StBasilsCathedral1Image, StBasilsCathedralImage.StBasilsCathedral2Image, StBasilsCathedralImage.StBasilsCathedral3Image, StBasilsCathedralImage.StBasilsCathedral4Image],
    history: 'Храм Василия Блаженного, расположенный на Красной площади в Москве, был построен в 1555-1561 годах по приказу царя Ивана IV (Ивана Грозного) в честь победы над Казанским ханством. Строительство храма стало символом триумфа русской армии и укрепления центральной власти. Архитектором храма считается Постник Яковлев, хотя некоторые источники указывают на его ученика Барму. Храм был задуман как уникальный архитектурный комплекс, состоящий из восьми приделов, каждый из которых посвящен отдельному святому. В 1588 году к храму была добавлена девятая глава, увенчанная золотым куполом, в честь святого Василия, который стал покровителем города. На протяжении веков храм пережил множество исторических событий и стал не только религиозным, но и культурным символом России, привлекая туристов со всего мира.',
    architecture: 'Архитектура Храма Василия Блаженного является ярким примером русского зодчества XVI века. Храм отличается необычной формой и яркой цветовой палитрой, что делает его одним из самых узнаваемых зданий. Его девять куполов, каждый из которых имеет уникальную форму и цвет, символизируют восемь главных святителей и Христа. Фасады храма украшены сложными узорами, мозаиками и резьбой, что придает ему особую выразительность. Внутреннее пространство храма также поражает своей красотой: стены украшены фресками и иконами, создающими атмосферу святости и умиротворения. Храм Василия Блаженного стал не только архитектурным шедевром, но и символом русской культуры, олицетворяющим духовное богатство и историческую значимость России.'
  }
]