import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as VondelparkImage from '@images/cities/Amsterdam/Vondelpark'

export const VondelparkData: AboutAttractionProps[] = [
  
  { 
    id: 1,
    title: 'Парк Вондела',
    image: [VondelparkImage.VondelparkImage, VondelparkImage.Vondelpark1Image, VondelparkImage.Vondelpark2Image, VondelparkImage.Vondelpark3Image, VondelparkImage.Vondelpark4Image],
    history: 'Парк Вондела, расположенный в сердце Амстердама, был основан в 1850 году и изначально носил название "Новый парк". В 1864 году он был переименован в честь известного голландского поэта Йоста ван ден Вондела. С момента своего открытия парк стал популярным местом для отдыха и досуга горожан. В конце 19 века произошли большие изменения, когда парк был реконструирован с помощью известных ландшафтных дизайнеров, добавив аллеи и пруды. Во время Второй мировой войны он стал важным местом для сопротивления, а в послевоенные годы парк занял центральное место в культурной жизни города, став площадкой для концертов и других общественных мероприятий. Сегодня Вондела привлекает туристов и местных жителей своей природной красотой, культурными событиями и исторической значимостью.',
    architecture: 'Архитектура Парка Вондела отражает сочетание естественных ландшафтов и продуманного дизайна. В парке можно наблюдать разнообразные архитектурные элементы, такие как павильоны, мостики и скульптуры. Одним из самых заметных сооружений является Вонделпавильон, построенный в 1934 году в стильных бетонных и стеклянных формах. Этот павильон служит культурным центром, где проводятся выставки и мероприятия. В парке также установлены несколько скульптур, в том числе "Поэт" и "Аврора" — произведения, которые подчеркивают культурное наследие Нидерландов. Красивые аллеи, покрытые зеленью и цветущими растениями, создают атмосферу уюта и спокойствия, сопоставимую с классическими английскими парками. Архитектурные элементы Вондела гармонично вписаны в естественный ландшафт, создавая уникальное пространство для отдыха и вдохновения.'
  }
]