import { AboutAttractionProps } from '@/types/AboutAttractionProps'
import * as MoscowStateUniversityImage from '@images/cities/Moscow/MoscowStateUniversity'

export const MoscowStateUniversityData: AboutAttractionProps[] = [

  { 
    id: 1,
    title: 'Московский государственный университет',
    image: [MoscowStateUniversityImage.MoscowStateUniversityImage, MoscowStateUniversityImage.MoscowStateUniversity1Image, MoscowStateUniversityImage.MoscowStateUniversity2Image, MoscowStateUniversityImage.MoscowStateUniversity3Image, MoscowStateUniversityImage.MoscowStateUniversity4Image],
    history: 'Московский государственный университет имени М.В. Ломоносова (МГУ) был основан в 1755 году по инициативе Михаила Ломоносова и стал первым университетом в России. Его создание стало важным шагом в развитии образования и науки в стране. В начале своего существования университет располагался в здании на Смоленской площади, но вскоре потребовалось больше пространства для растущего числа студентов и преподавателей. В 1953 году был открыт новый кампус на Воробьевых горах, который стал символом университета. МГУ сыграл значительную роль в подготовке научных кадров и развитии различных областей знаний, включая физику, математику, биологию и гуманитарные науки. Сегодня университет является одним из ведущих образовательных учреждений России и мира, привлекая студентов из разных стран.',
    architecture: 'Архитектура Московского государственного университета на Воробьевых горах представляет собой выдающийся пример сталинского ампира. Главное здание университета, высотой 240 метров, является одним из семи "сталинских высоток" и было построено в 1953 году. Его фасад украшен колоннами, скульптурами и декоративными элементами, что придает зданию величественный вид. Внутри университета находятся просторные аудитории, библиотеки и научные лаборатории, оформленные в классическом стиле. Комплекс МГУ окружен живописными парками и аллеями, что создает гармоничное сочетание природы и архитектуры. Архитектурный ансамбль университета стал не только учебным заведением, но и важной частью культурного наследия Москвы, привлекающей туристов и исследователей со всего мира.'
  }
]